nakhonthai/ESP32APRS_T-TWR/src/main.cpp
/*
 Name:		ESP32APRS T-TWR Plus
 Created:	13-10-2023 14:27:23
 Author:	HS5TQA/Atten
 Support IS: host:aprs.dprns.com port:14580 or aprs.hs5tqa.ampr.org:14580
 Support IS monitor: http://aprs.dprns.com:14501 or http://aprs.hs5tqa.ampr.org:14501
*/

#include <Arduino.h>
#include "main.h"
#include <LibAPRSesp.h>
#include <limits.h>
#include <KISS.h>
#include "webservice.h"
#include <WiFiUdp.h>
#include "ESP32Ping.h"
#include <WiFi.h>
#include <WiFiMulti.h>
#include <WiFiClient.h>
#include <BLEDevice.h>
#include <BLEServer.h>
#include <BLEUtils.h>
#include <BLE2902.h>
#include "XPowersLib.h"
#include "cppQueue.h"
#include "digirepeater.h"
#include "igate.h"
#include "wireguardif.h"
#include "wireguard.h"
#include "wireguard_vpn.h"

#include "time.h"

#include <TinyGPSPlus.h>
#include <pbuf.h>
#include <parse_aprs.h>
// #include <Fonts/FreeSansBold9pt7b.h>
// #include <Fonts/FreeSerifItalic9pt7b.h>
// #include <Fonts/Seven_Segment24pt7b.h>

#include <WiFiUdp.h>

#include <WiFiClientSecure.h>

#include "AFSK.h"

#include "gui_lcd.h"

#define DEBUG_TNC

#define EEPROM_SIZE 2048

// #ifdef SDCARD
// #include <SPI.h> //SPI.h must be included as DMD is written by SPI (the IDE complains otherwise)
// #include "FS.h"
// #include "SPIFFS.h"
// #define SDCARD_CS 10
// #define SDCARD_CLK 12
// #define SDCARD_MOSI 11
// #define SDCARD_MISO 13
// #endif

#ifdef OLED
#include <Wire.h>
#include "Adafruit_SSD1306.h"
#include <Adafruit_GFX.h>
#include <Adafruit_I2CDevice.h>

#define SCREEN_WIDTH 128 // OLED display width, in pixels
#define SCREEN_HEIGHT 64 // OLED display height, in pixels
// Declaration for an SSD1306 display connected to I2C (SDA, SCL pins)
// The pins for I2C are defined by the Wire-library.
// On an arduino UNO:       A4(SDA), A5(SCL)
// On an arduino MEGA 2560: 20(SDA), 21(SCL)
// On an arduino LEONARDO:   2(SDA),  3(SCL), ...
#define OLED_RESET -1       // Reset pin # (or -1 if sharing Arduino reset pin)
#define SCREEN_ADDRESS 0x3D ///< See datasheet for Address; 0x3D for 128x64, 0x3C for 128x32
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, -1);

#endif

struct pbuf_t aprs;
ParseAPRS aprsParse;

TinyGPSPlus gps;

#define VBAT_PIN 36
#define POWER_PIN SA868_PWR_PIN
#define PULLDOWN_PIN SA868_PD_PIN
#define SQL_PIN -1
HardwareSerial SerialRF(1);

#define PWR_VDD 4

#define MODEM_PWRKEY 5
#define MODEM_TX 13
#define MODEM_RX 14

#define LED_TX -1
#define LED_RX 5

#define PPP_APN "internet"
#define PPP_USER ""
#define PPP_PASS ""

char send_aprs_table, send_aprs_symbol;

RTC_DATA_ATTR time_t systemUptime;
time_t wifiUptime = 0;

boolean KISS = false;
bool aprsUpdate = false;

boolean gotPacket = false;
AX25Msg incomingPacket;

bool lastPkg = false;
bool afskSync = false;
String lastPkgRaw = "";
float dBV = 0;
int mVrms = 0;

float vbat;

uint8_t dispFlagTX = 0;

long timeNetwork, timeAprs, timeGui;

unsigned long previousMillis = 0; // กำหนดตัวแปรเก็บค่า เวลาสุดท้ายที่ทำงาน
long interval = 10000;            // กำหนดค่าตัวแปร ให้ทำงานทุกๆ 10 วินาที
int conStat = 0;
int conStatNetwork = 0;

cppQueue PacketBuffer(sizeof(AX25Msg), 10, IMPLEMENTATION); // Instantiate queue
// cppQueue dispBuffer(300, 100, IMPLEMENTATION);

statusType status;
RTC_DATA_ATTR igateTLMType igateTLM;
#ifdef BOARD_HAS_PSRAM
txQueueType *txQueue;
#else
RTC_DATA_ATTR txQueueType txQueue[PKGTXSIZE];
#endif

RTC_DATA_ATTR double LastLat, LastLng;
RTC_DATA_ATTR time_t lastTimeStamp;

extern RTC_DATA_ATTR uint8_t digiCount;

String RF_VERSION;

XPowersAXP2101 PMU;

Configuration config;

pkgListType *pkgList;

TelemetryType *Telemetry;

TaskHandle_t taskNetworkHandle;
TaskHandle_t taskAPRSHandle;
TaskHandle_t mainDisplayHandle;
TaskHandle_t taskGpsHandle;
TaskHandle_t taskTNCHandle;

bool firstGpsTime = true;
time_t startTime = 0;
HardwareSerial SerialGPS(2);
BLEServer *pServer = NULL;
BLECharacteristic *pTxCharacteristic;
bool BTdeviceConnected = false;
bool BToldDeviceConnected = false;
uint8_t BTtxValue = 0;

class MyServerCallbacks : public BLEServerCallbacks
{
  void onConnect(BLEServer *pServer)
  {
    BTdeviceConnected = true;
  };

  void onDisconnect(BLEServer *pServer)
  {
    BTdeviceConnected = false;
  }
};

class MyCallbacks : public BLECharacteristicCallbacks
{
  void onWrite(BLECharacteristic *pCharacteristic)
  {
    std::string rxValue = pCharacteristic->getValue();

    if (rxValue.length() > 0)
    {
      // Serial.println("*********");
      // Serial.print("Received Value: ");
      char raw[500];
      memset(raw, 0, sizeof(raw));
      for (int i = 0; i < rxValue.length(); i++)
      {
        if (i > sizeof(raw))
          break;
        raw[i] = (char)rxValue[i];
        if (raw[i] == 0)
          break;
      }
      if (config.bt_mode == 1)
      { // TNC2RAW MODE
        pkgTxPush(raw, strlen(raw), 1);
      }
      // for (int i = 0; i < rxValue.length(); i++)
      //   Serial.print(rxValue[i]);

      // Serial.println();
      // Serial.println("*********");
    }
  }
};

// Set your Static IP address for wifi AP
IPAddress local_IP(192, 168, 4, 1);
IPAddress gateway(192, 168, 4, 254);
IPAddress subnet(255, 255, 255, 0);

IPAddress vpn_IP(192, 168, 44, 195);

int pkgTNC_count = 0;

/// Degrees to radians.
#define DEG2RAD(x) (x / 360 * 2 * PI)
/// Radians to degrees.
#define RAD2DEG(x) (x * (180 / PI))

double direction(double lon0, double lat0, double lon1, double lat1)
{
  double direction;

  /* Convert degrees into radians. */
  lon0 = DEG2RAD(lon0);
  lat0 = DEG2RAD(lat0);
  lon1 = DEG2RAD(lon1);
  lat1 = DEG2RAD(lat1);

  /* Direction from Aviation Formulary V1.42 by Ed Williams by way of
   * http://mathforum.org/library/drmath/view/55417.html */
  direction = atan2(sin(lon1 - lon0) * cos(lat1), cos(lat0) * sin(lat1) - sin(lat0) * cos(lat1) * cos(lon1 - lon0));
  if (direction < 0)
  {
    /* Make direction positive. */
    direction += 2 * PI;
  }

  return RAD2DEG(direction);
}

double distance(double lon0, double lat0, double lon1, double lat1)
{
  double dlon;
  double dlat;
  double a, c;
  /* Convert degrees into radians. */
  lon0 = DEG2RAD(lon0);
  lat0 = DEG2RAD(lat0);
  lon1 = DEG2RAD(lon1);
  lat1 = DEG2RAD(lat1);

  /* Use the haversine formula for distance calculation
   * http://mathforum.org/library/drmath/view/51879.html */
  dlon = lon1 - lon0;
  dlat = lat1 - lat0;
  a = pow(sin(dlat / 2), 2) + cos(lat0) * cos(lat1) * pow(sin(dlon / 2), 2);
  c = 2 * atan2(sqrt(a), sqrt(1 - a));

  return c * 6366.71; /* in kilometers */
}

void GPS_INIT()
{
  SerialGPS.begin(9600, SERIAL_8N1, GNSS_RX, GNSS_TX);
  SerialGPS.flush();
  while (SerialGPS.available() > 0)
    SerialGPS.read();
  // SerialGPS.print("\r\n");
  // SerialGPS.print("$PMTK161,1*28\r\n");
  // SerialGPS.print("$PMTK225,0*2B\r\n");
  // SerialGPS.print("$PMTK869,1,0*34\r\n");
}

// SmartBeaconing(tm) algorithm adapted from HamHUD
char EVENT_TX_POSITION = 0;
unsigned char SB_SPEED = 0, SB_SPEED_OLD = 0;
int16_t SB_HEADING = 0;
uint16_t tx_interval = 0, igate_tx_interval, digi_tx_interval; // How often we transmit, in seconds
unsigned int tx_counter, igate_tx_counter, digi_tx_counter;    // Incremented every second
int16_t last_heading, heading_change;                          // Keep track of corner pegging
uint16_t trk_interval = 15;

void smartbeacon(void)
{
  // Adaptive beacon rate
  if (SB_SPEED >= config.trk_hspeed)
  {
    tx_interval = (uint16_t)config.trk_maxinterval;
  }
  else
  {
    if (SB_SPEED <= config.trk_lspeed)
    {
      // Speed is below lower limit - use minimum rate
      tx_interval = (uint16_t)config.trk_slowinterval;
    }
    else
    {
      // In between, do SmartBeaconing calculations
      if (SB_SPEED <= 0)
        SB_SPEED = 1;
      tx_interval = (trk_interval * config.trk_hspeed) / SB_SPEED;
      if (tx_interval < 5)
        tx_interval = 5;
      if (tx_interval > config.trk_maxinterval)
        tx_interval = (uint16_t)config.trk_maxinterval;

      // Corner pegging - note that we use two-degree units
      if (last_heading > SB_HEADING)
        heading_change = last_heading - SB_HEADING;
      else
        heading_change = SB_HEADING - last_heading;
      if (heading_change > 90)
        heading_change = 180 - heading_change;
      if (heading_change > config.trk_minangle)
      {
        // Make sure last heading is updated during turns to avoid immedate xmit
        if (tx_counter > config.trk_mininterval)
        {
          EVENT_TX_POSITION = 3;
        }
        else
        {
          // last_heading = SB_HEADING;
          tx_interval = config.trk_mininterval;
        }
      }
    }
  }
}

// void printTime()
// {
// 	SerialLOG.print("[");
// 	SerialLOG.print(hour());
// 	SerialLOG.print(":");
// 	SerialLOG.print(minute());
// 	SerialLOG.print(":");
// 	SerialLOG.print(second());
// 	SerialLOG.print("]");
// }

