nakhonthai/ESP32APRS_T-TWR/src/main.cpp
String deg2lat(double deg)
{
  char sign;
  if (deg > 0.0F)
  {
    sign = 'N';
  }
  else
  {
    sign = 'S';
    deg *= -1;
  }

  uint id = (uint)floor(deg);
  uint im = (uint)((deg - (double)id) * 60);
  uint imm = (uint)round((((deg - (double)id) * 60) - (double)im) * 100);
  char dmm[10];
  sprintf(dmm, "%02d%02d.%02d%c", id, im, imm, sign);
  return String(dmm);
}

String deg2lon(double deg)
{
  char sign;
  if (deg > 0.0F)
  {
    sign = 'E';
  }
  else
  {
    sign = 'W';
    deg *= -1;
  }
  uint id = (uint)floor(deg);
  uint im = (uint)((deg - (double)id) * 60);
  uint imm = (uint)round((((deg - (double)id) * 60) - (double)im) * 100);
  char dmm[10];
  sprintf(dmm, "%03d%02d.%02d%c", id, im, imm, sign);
  return String(dmm);
}

time_t setGpsTime()
{
  time_t time;
  tmElements_t timeinfo;
  if (gps.time.isValid())
  {
    timeinfo.Year = (gps.date.year()) - 1970;
    timeinfo.Month = gps.date.month();
    timeinfo.Day = gps.date.day();
    timeinfo.Hour = gps.time.hour();
    timeinfo.Minute = gps.time.minute();
    timeinfo.Second = gps.time.second();
    time_t timeStamp = makeTime(timeinfo);
    time = timeStamp + TZ * SECS_PER_HOUR;
    setTime(time);
    // setTime(timeinfo.Hour,timeinfo.Minute,timeinfo.Second,timeinfo.Day, timeinfo.Month, timeinfo.Year);
    return time;
  }
  return 0;
}

time_t getGpsTime()
{
  time_t time;
  tmElements_t timeinfo;
  if (gps.time.isValid())
  {
    timeinfo.Year = (gps.date.year()) - 1970;
    timeinfo.Month = gps.date.month();
    timeinfo.Day = gps.date.day();
    timeinfo.Hour = gps.time.hour();
    timeinfo.Minute = gps.time.minute();
    timeinfo.Second = gps.time.second();
    time_t timeStamp = makeTime(timeinfo);
    time = timeStamp + TZ * SECS_PER_HOUR;
    return time;
  }
  return 0;
}

String getValue(String data, char separator, int index)
{
  int found = 0;
  int strIndex[] = {0, -1};
  int maxIndex = data.length();

  for (int i = 0; i <= maxIndex && found <= index; i++)
  {
    if (data.charAt(i) == separator || i == maxIndex)
    {
      found++;
      strIndex[0] = strIndex[1] + 1;
      strIndex[1] = (i == maxIndex) ? i + 1 : i;
    }
  }
  return found > index ? data.substring(strIndex[0], strIndex[1]) : "";
} // END

boolean isValidNumber(String str)
{
  for (byte i = 0; i < str.length(); i++)
  {
    if (isDigit(str.charAt(i)))
      return true;
  }
  return false;
}

uint8_t checkSum(uint8_t *ptr, size_t count)
{
  uint8_t lrc, tmp;
  uint16_t i;
  lrc = 0;
  for (i = 0; i < count; i++)
  {
    tmp = *ptr++;
    lrc = lrc ^ tmp;
  }
  return lrc;
}

void saveEEPROM()
{
  uint8_t chkSum = 0;
  byte *ptr;
  ptr = (byte *)&config;
  EEPROM.writeBytes(1, ptr, sizeof(Configuration));
  chkSum = checkSum(ptr, sizeof(Configuration));
  EEPROM.write(0, chkSum);
  EEPROM.commit();
#ifdef DEBUG
  log_d("Save EEPROM ChkSUM=");
  log_d("%0X\n", chkSum);
#endif
}

void defaultConfig()
{
  log_d("Default configure mode!");
  config.synctime = true;
  config.timeZone = 7;
  config.tx_timeslot = 2000; // ms

  config.wifi_mode = WIFI_AP_STA_FIX;
  config.wifi_power = 44;
  config.wifi_ap_ch = 6;
  sprintf(config.wifi_ssid, "APRSTH");
  sprintf(config.wifi_pass, "aprsthnetwork");
  sprintf(config.wifi_ap_ssid, "ESP32IGate");
  sprintf(config.wifi_ap_pass, "aprsthnetwork");
  // Blutooth
  config.bt_slave = false;
  config.bt_master = false;
  config.bt_mode = 1; // 0-None,1-TNC2RAW,2-KISS
  config.bt_power = 1;
  sprintf(config.bt_uuid, "6E400001-B5A3-F393-E0A9-E50E24DCCA9E");
  sprintf(config.bt_uuid_rx, "6E400002-B5A3-F393-E0A9-E50E24DCCA9E");
  sprintf(config.bt_uuid_tx, "6E400003-B5A3-F393-E0A9-E50E24DCCA9E");
  sprintf(config.bt_name, "ESP32APRS");
  sprintf(config.bt_pin, "0000");

  //--RF Module
  config.rf_en = true;
  config.rf_type = RF_SA868_VHF;
  config.freq_rx = 144.3900;
  config.freq_tx = 144.3900;
  config.offset_rx = 0;
  config.offset_tx = 0;
  config.tone_rx = 0;
  config.tone_tx = 0;
  config.band = 0;
  config.sql_level = 1;
  config.rf_power = LOW;
  config.volume = 6;
  config.mic = 8;

  // IGATE
  config.igate_bcn = false;
  config.igate_en = false;
  config.rf2inet = true;
  config.inet2rf = false;
  config.igate_loc2rf = false;
  config.igate_loc2inet = true;
  //--APRS-IS
  config.aprs_ssid = 1;
  config.aprs_port = 14580;
  sprintf(config.aprs_mycall, "NOCALL");
  sprintf(config.aprs_host, "aprs.dprns.com");
  sprintf(config.aprs_passcode, "");
  sprintf(config.aprs_moniCall, "%s-%d", config.aprs_mycall, config.aprs_ssid);
  sprintf(config.aprs_filter, "m/10");
  //--Position
  config.igate_gps = false;
  config.igate_lat = 13.7555;
  config.igate_lon = 100.4930;
  config.igate_alt = 0;
  config.igate_interval = 600;
  sprintf(config.igate_symbol, "/&");
  sprintf(config.igate_object, "");
  sprintf(config.igate_phg, "");
  sprintf(config.igate_path, "WIDE1-1");
  sprintf(config.igate_comment, "IGate MODE");

  // DIGI REPEATER
  config.digi_en = false;
  config.digi_loc2rf = true;
  config.digi_loc2inet = false;
  config.digi_ssid = 3;
  sprintf(config.digi_mycall, "NOCALL");
  sprintf(config.digi_path, "WIDE1-1");
  //--Position
  config.digi_gps = false;
  config.digi_lat = 13.7555;
  config.digi_lon = 100.4930;
  config.digi_alt = 0;
  config.digi_interval = 600;
  config.digi_delay = 0;
  sprintf(config.digi_symbol, "/#");
  sprintf(config.digi_phg, "");
  sprintf(config.digi_comment, "DIGI MODE");

  // Tracker
  config.trk_en = false;
  config.trk_loc2rf = true;
  config.trk_loc2inet = false;
  config.trk_bat = false;
  config.trk_sat = false;
  config.trk_dx = false;
  config.trk_ssid = 9;
  sprintf(config.trk_mycall, "NOCALL");
  sprintf(config.trk_path, "WIDE1-1,WIDE2-1");

  //--Position
  config.trk_gps = false;
  config.trk_lat = 13.7555;
  config.trk_lon = 100.4930;
  config.trk_alt = 0;
  config.trk_interval = 600;
  // Smart beacon
  config.trk_smartbeacon = true;
  config.trk_compress = true;
  config.trk_altitude = true;
  config.trk_cst = true;
  config.trk_hspeed = 120;
  config.trk_lspeed = 5;
  config.trk_maxinterval = 30;
  config.trk_mininterval = 5;
  config.trk_minangle = 25;
  config.trk_slowinterval = 600;

  sprintf(config.trk_symbol, "\\>");
  sprintf(config.trk_symmove, "/>");
  sprintf(config.trk_symstop, "\\>");
  // sprintf(config.trk_btext, "");
  sprintf(config.trk_mycall, "NOCALL");
  sprintf(config.trk_comment, "TRACKER MODE");
  sprintf(config.trk_item, "");
  // sprintf(config.trk_item, "");

