nakhonthai/ESP32APRS_T-TWR/src/main.cpp
  // OLED DISPLAY
  config.oled_enable = true;
  config.oled_timeout = 60;
  config.dim = 0;
  config.contrast = 0;
  config.startup = 0;

  // Display
  config.dispDelay = 3; // Popup display 3 sec
  config.dispRF = true;
  config.dispINET = false;
  config.filterDistant = 0;
  config.h_up = true;
  config.tx_display = true;
  config.rx_display=true;
  config.audio_hpf = false;
  config.audio_bpf = false;
  config.preamble = 3;
  sprintf(config.ntp_host, "ntp.dprns.com");

  sprintf(config.path[0], "WIDE1-1");
  sprintf(config.path[1], "WIDE1-1,WIDE2-1");
  sprintf(config.path[2], "TRACK3-3");
  sprintf(config.path[3], "RS0ISS");

  // VPN Wireguard
  config.vpn = false;
  config.wg_port = 51820;
  sprintf(config.wg_peer_address, "vpn.dprns.com");
  sprintf(config.wg_local_address, "192.168.1.2");
  sprintf(config.wg_netmask_address, "255.255.255.0");
  sprintf(config.wg_gw_address, "192.168.1.1");
  sprintf(config.wg_public_key, "");
  sprintf(config.wg_private_key, "");

  config.gpio_sql_pin = -1;

  saveEEPROM();
}

unsigned long NTP_Timeout;
unsigned long pingTimeout;

bool psramBusy = false;

// const char *lastTitle = "LAST HEARD";

int tlmList_Find(char *call)
{
  int i;
  // while (psramBusy) delay(1);
  // psramBusy = true;
  for (i = 0; i < TLMLISTSIZE; i++)
  {
    if (strstr(Telemetry[i].callsign, call) != NULL)
    {
      psramBusy = false;
      return i;
    }
  }
  // psramBusy = false;
  return -1;
}

int tlmListOld()
{
  // while (psramBusy) delay(1);
  // psramBusy = true;
  int i, ret = 0;
  time_t minimum = Telemetry[0].time;
  for (i = 1; i < TLMLISTSIZE; i++)
  {
    if (Telemetry[i].time < minimum)
    {
      minimum = Telemetry[i].time;
      ret = i;
    }
    if (Telemetry[i].time > time(NULL))
      Telemetry[i].time = 0;
  }
  // psramBusy = false;
  return ret;
}

TelemetryType getTlmList(int idx)
{
  TelemetryType ret;
  while (psramBusy)
    delay(1);
  psramBusy = true;
  memcpy(&ret, &Telemetry[idx], sizeof(TelemetryType));
  psramBusy = false;
  return ret;
}

int pkgList_Find(char *call)
{
  int i;
  for (i = 0; i < PKGLISTSIZE; i++)
  {
    if (strstr(pkgList[(int)i].calsign, call) != NULL)
      return i;
  }
  return -1;
}

int pkgList_Find(char *call, uint16_t type)
{
  int i;
  for (i = 0; i < PKGLISTSIZE; i++)
  {
    if ((strstr(pkgList[i].calsign, call) != NULL) && (pkgList[i].type == type))
      return i;
  }
  return -1;
}

int pkgListOld()
{
  int i, ret = -1;
  time_t minimum = time(NULL) + 86400; // pkgList[0].time;
  for (i = 0; i < PKGLISTSIZE; i++)
  {
    if (pkgList[(int)i].time < minimum)
    {
      minimum = pkgList[(int)i].time;
      ret = i;
    }
  }
  return ret;
}

void sort(pkgListType a[], int size)
{
  pkgListType t;
  char *ptr1;
  char *ptr2;
  char *ptr3;
  ptr1 = (char *)&t;
  while (psramBusy)
    delay(1);
  psramBusy = true;
  for (int i = 0; i < (size - 1); i++)
  {
    for (int o = 0; o < (size - (i + 1)); o++)
    {
      if (a[o].time < a[o + 1].time)
      {
        ptr2 = (char *)&a[o];
        ptr3 = (char *)&a[o + 1];
        memcpy(ptr1, ptr2, sizeof(pkgListType));
        memcpy(ptr2, ptr3, sizeof(pkgListType));
        memcpy(ptr3, ptr1, sizeof(pkgListType));
      }
    }
  }
  psramBusy = false;
}

void sortPkgDesc(pkgListType a[], int size)
{
  pkgListType t;
  char *ptr1;
  char *ptr2;
  char *ptr3;
  ptr1 = (char *)&t;
  while (psramBusy)
    delay(1);
  psramBusy = true;
  for (int i = 0; i < (size - 1); i++)
  {
    for (int o = 0; o < (size - (i + 1)); o++)
    {
      if (a[o].pkg < a[o + 1].pkg)
      {
        ptr2 = (char *)&a[o];
        ptr3 = (char *)&a[o + 1];
        memcpy(ptr1, ptr2, sizeof(pkgListType));
        memcpy(ptr2, ptr3, sizeof(pkgListType));
        memcpy(ptr3, ptr1, sizeof(pkgListType));
      }
    }
  }
  psramBusy = false;
}

uint16_t pkgType(const char *raw)
{
  uint16_t type = 0;
  char packettype = 0;
  const char *info_start, *body;
  int paclen = strlen(raw);

  if (*raw == 0)
    return 0;

  packettype = (char)raw[0];
  body = &raw[1];

  switch (packettype)
  {
  case '$': // NMEA
    type |= FILTER_POSITION;
    break;
  case 0x27: /* ' */
  case 0x60: /* ` */
    type |= FILTER_POSITION;
    type |= FILTER_MICE;
    break;
  case '!':
  case '=':
    type |= FILTER_POSITION;
    if (body[18] == '_' || body[10] == '_')
    {
      type |= FILTER_WX;
      break;
    }
  case '/':
  case '@':
    type |= FILTER_POSITION;
    if (body[25] == '_' || body[16] == '_')
    {
      type |= FILTER_WX;
      break;
    }
    if (strchr(body, 'r') != NULL)
    {
      if (strchr(body, 'g') != NULL)
      {
        if (strchr(body, 't') != NULL)
        {
          if (strchr(body, 'P') != NULL)
          {
            type |= FILTER_WX;
          }
        }
      }
    }
    break;
  case ':':
    if (body[9] == ':' &&
        (memcmp(body + 10, "PARM", 4) == 0 ||
         memcmp(body + 10, "UNIT", 4) == 0 ||
         memcmp(body + 10, "EQNS", 4) == 0 ||
         memcmp(body + 10, "BITS", 4) == 0))
    {
      type |= FILTER_TELEMETRY;
    }
    else
    {
      type |= FILTER_MESSAGE;
    }
    break;
  case '{': // User defind
  case '<': // statcapa
  case '>':
    type |= FILTER_STATUS;
    break;
  case '?':
    type |= FILTER_QUERY;
    break;
  case ';':
    if (body[28] == '_')
      type |= FILTER_WX;
    else
      type |= FILTER_OBJECT;
    break;
  case ')':
    type |= FILTER_ITEM;
    break;
  case '}':
    type |= FILTER_THIRDPARTY;
    break;
  case 'T':
    type |= FILTER_TELEMETRY;
    break;
  case '#': /* Peet Bros U-II Weather Station */
  case '*': /* Peet Bros U-I  Weather Station */
  case '_': /* Weather report without position */
    type |= FILTER_WX;
    break;
  default:
    type = 0;
    break;
  }
  return type;
}

uint16_t TNC2Raw[PKGLISTSIZE];
int raw_count = 0, raw_idx_rd = 0, raw_idx_rw = 0;

int pushTNC2Raw(int raw)
{
  if (raw < 0)
    return -1;
  if (raw_count > PKGLISTSIZE)
    return -1;
  if (++raw_idx_rw >= PKGLISTSIZE)
    raw_idx_rw = 0;
  TNC2Raw[raw_idx_rw] = raw;
  raw_count++;
  return raw_count;
}

