nakhonthai/ESP32APRS_T-TWR/src/main.cpp
int popTNC2Raw(int &ret)
{
  String raw = "";
  int idx = 0;
  if (raw_count <= 0)
    return -1;
  if (++raw_idx_rd >= PKGLISTSIZE)
    raw_idx_rd = 0;
  idx = TNC2Raw[raw_idx_rd];
  if (idx < PKGLISTSIZE)
    ret = idx;
  if (raw_count > 0)
    raw_count--;
  return raw_count;
}

pkgListType getPkgList(int idx)
{
  pkgListType ret;
  while (psramBusy)
    delay(1);
  psramBusy = true;
  memcpy(&ret, &pkgList[idx], sizeof(pkgListType));
  psramBusy = false;
  return ret;
}

int pkgListUpdate(char *call, char *raw, uint16_t type, bool channel)
{
  size_t len;
  if (*call == 0)
    return -1;
  if (*raw == 0)
    return -1;

  char callsign[11];
  size_t sz = strlen(call);
  memset(callsign, 0, 11);
  if (sz > 10)
    sz = 10;
  // strncpy(callsign, call, sz);
  memcpy(callsign, call, sz);

  while (psramBusy)
    delay(1);
  psramBusy = true;

  int i = pkgList_Find(callsign, type);
  if (i > PKGLISTSIZE)
  {
    psramBusy = false;
    return -1;
  }
  if (i > -1)
  { // Found call in old pkg
    if (channel == pkgList[i].channel)
    {
      pkgList[i].time = time(NULL);
      pkgList[i].pkg++;
      pkgList[i].type = type;
      if (channel == 0)
        pkgList[i].audio_level = (int16_t)mVrms;
      else
        pkgList[i].audio_level = 0;
      len = strlen(raw);
      if (len > 500)
        len = 500;
      memcpy(pkgList[i].raw, raw, len);
      // SerialLOG.print("Update: ");
    }
  }
  else
  {
    i = pkgListOld(); // Search free in array
    if (i > PKGLISTSIZE || i < 0)
    {
      psramBusy = false;
      return -1;
    }
    // memset(&pkgList[i], 0, sizeof(pkgListType));
    pkgList[i].channel = channel;
    pkgList[i].time = time(NULL);
    pkgList[i].pkg = 1;
    pkgList[i].type = type;
    if (channel == 0)
      pkgList[i].audio_level = (int16_t)mVrms;
    else
      pkgList[i].audio_level = 0;
    // strcpy(pkgList[i].calsign, callsign);
    memcpy(pkgList[i].calsign, callsign, strlen(callsign));
    len = strlen(raw);
    if (len > 500)
      len = 500;
    memcpy(pkgList[i].raw, raw, len);
    // strcpy(pkgList[i].raw, raw);
    pkgList[i].calsign[10] = 0;
    // SerialLOG.print("NEW: ");
  }
  psramBusy = false;
  return i;
}

bool pkgTxPush(const char *info, size_t len, int dly)
{
  char *ecs = strstr(info, ">");
  if (ecs == NULL)
    return false;

  while (psramBusy)
    delay(1);
  psramBusy = true;
  for (int i = 0; i < PKGTXSIZE; i++)
  {
    if (txQueue[i].Active)
    {
      if (!(strncmp(&txQueue[i].Info[0], info, info - ecs)))
      {
        // strcpy(&txQueue[i].Info[0], info);
        memset(txQueue[i].Info, 0, sizeof(txQueue[i].Info));
        memcpy(&txQueue[i].Info[0], info, len);
        txQueue[i].Delay = dly;
        txQueue[i].timeStamp = millis();
        psramBusy = false;
        return true;
      }
    }
  }

  // Add
  for (int i = 0; i < PKGTXSIZE; i++)
  {
    if (txQueue[i].Active == false)
    {
      memset(txQueue[i].Info, 0, sizeof(txQueue[i].Info));
      memcpy(&txQueue[i].Info[0], info, len);
      txQueue[i].Delay = dly;
      txQueue[i].Active = true;
      txQueue[i].timeStamp = millis();
      break;
    }
  }
  psramBusy = false;
  return true;
}

bool pkgTxSend()
{
  if (getReceive())
    return false;
  while (psramBusy)
    delay(1);
  psramBusy = true;
  for (int i = 0; i < PKGTXSIZE; i++)
  {
    if (txQueue[i].Active)
    {
      int decTime = millis() - txQueue[i].timeStamp;
      if (decTime > txQueue[i].Delay)
      {
        txQueue[i].Active = false;
        char info[500];
        memset(info, 0, sizeof(info));
        strcpy(info, txQueue[i].Info);
        psramBusy = false;
        digitalWrite(POWER_PIN, config.rf_power); // RF Power LOW
        status.txCount++;
        LED_Color(255, 0, 0);
        adcActive(false);

        APRS_setPreamble(config.preamble * 100);
        APRS_sendTNC2Pkt(String(info)); // Send packet to RF
        // printTime();
        log_d("TX->RF: %s\n", info);

        for (int i = 0; i < 100; i++)
        {
          if (digitalRead(PTT_PIN))
            break;
          delay(50); // TOT 5sec
        }
        LED_Color(0, 0, 0);
        digitalWrite(POWER_PIN, 0); // set RF Power Low
        adcActive(true);
        dispFlagTX = 1;
        return true;
      }
    }
  }
  psramBusy = false;
  return false;
}

uint8_t *packetData;
// ฟังชั่นถูกเรียกมาจาก ax25_decode
void aprs_msg_callback(struct AX25Msg *msg)
{
  AX25Msg pkg;

  memcpy(&pkg, msg, sizeof(AX25Msg));
  PacketBuffer.push(&pkg); // ใส่แพ็จเก็จจาก TNC ลงคิวบัพเฟอร์
  status.rxCount++;
  // String tnc2;
  //         packet2Raw(tnc2, pkg);
  //         log_d("RX: %s", tnc2.c_str());
}

void printTime()
{
  struct tm tmstruct;
  getLocalTime(&tmstruct, 500);
  Serial.print("[");
  Serial.print(tmstruct.tm_hour);
  Serial.print(":");
  Serial.print(tmstruct.tm_min);
  Serial.print(":");
  Serial.print(tmstruct.tm_sec);
  Serial.print("]");
}

uint8_t gwRaw[PKGLISTSIZE][66];
uint8_t gwRawSize[PKGLISTSIZE];
int gwRaw_count = 0, gwRaw_idx_rd = 0, gwRaw_idx_rw = 0;

void pushGwRaw(uint8_t *raw, uint8_t size)
{
  if (gwRaw_count > PKGLISTSIZE)
    return;
  if (++gwRaw_idx_rw >= PKGLISTSIZE)
    gwRaw_idx_rw = 0;
  if (size > 65)
    size = 65;
  memcpy(&gwRaw[gwRaw_idx_rw][0], raw, size);
  gwRawSize[gwRaw_idx_rw] = size;
  gwRaw_count++;
}

uint8_t popGwRaw(uint8_t *raw)
{
  uint8_t size = 0;
  if (gwRaw_count <= 0)
    return 0;
  if (++gwRaw_idx_rd >= PKGLISTSIZE)
    gwRaw_idx_rd = 0;
  size = gwRawSize[gwRaw_idx_rd];
  memcpy(raw, &gwRaw[gwRaw_idx_rd][0], size);
  if (gwRaw_count > 0)
    gwRaw_count--;
  return size;
}

void setupPowerRF()
{
  // bool result = PMU.begin(Wire, AXP2101_SLAVE_ADDRESS, I2C_SDA, I2C_SCL);
  // if (result == false) {
  //     while (1) {
  //         Serial.println("PMU is not online...");
  //         delay(500);
  //     }
  // }
  //! DC3 Radio Pixels VDD , Don't change
  PMU.setDC3Voltage(3400);
  PMU.enableDC3();
}

bool SA868_waitResponse(String &data, String rsp, uint32_t timeout)
{
  uint32_t startMillis = millis();
  do
  {
    while (SerialRF.available() > 0)
    {
      int8_t ch = SerialRF.read();
      data += static_cast<char>(ch);
      if (rsp.length() && data.endsWith(rsp))
      {
        return true;
      }
    }
  } while (millis() - startMillis < 1000);
  return false;
}

