nakhonthai/ESP32APRS_T-TWR/src/main.cpp
int SA868_getRSSI()
{
  String data;
  int rssi;

  // Serial.printf("AT+RSSI?\r\n");
  SerialRF.printf("AT+RSSI?\r\n");
  if (SA868_waitResponse(data, "\r\n", 1000))
  {
    // Serial.println(INFO + data);
    String rssi = data.substring(data.indexOf("RSSI=") + strlen("RSSI="), data.indexOf("\r\n"));
    rssi = rssi.toInt();
    return rssi.toInt();
  }
  else
  {
    // timeout or error
    return 0;
  }
}

String SA868_getVERSION()
{
  String data;
  int rssi;

  SerialRF.printf("AT+VERSION\r\n");
  if (SA868_waitResponse(data, "\r\n", 1000))
  {
    String version = data.substring(0, data.indexOf("\r\n"));
    return version;
  }
  else
  {
    // timeout or error
    return "-";
  }
}

unsigned long SA818_Timeout = 0;

void RF_MODULE_SLEEP()
{
  digitalWrite(POWER_PIN, LOW);
  digitalWrite(PULLDOWN_PIN, LOW);
  // PMU.disableDC3();
}

void RF_MODULE(bool boot)
{
  String data;
  if (config.rf_en == false)
  {
    RF_MODULE_SLEEP();
    return;
  }
  if (config.rf_type == RF_NONE)
    return;
  log_d("RF Module %s Init", RF_TYPE[config.rf_type]);
  //! DC3 Radio & Pixels VDD , Don't change
  // PMU.setDC3Voltage(3400);
  // PMU.disableDC3();

  pinMode(SA868_PD_PIN, OUTPUT);
  digitalWrite(SA868_PD_PIN, HIGH); // PWR HIGH

  pinMode(SA868_PWR_PIN, OUTPUT);
  digitalWrite(SA868_PWR_PIN, LOW); // RF POWER LOW

  pinMode(SA868_PTT_PIN, OUTPUT);
  digitalWrite(SA868_PTT_PIN, HIGH); // PTT HIGH

  setupPowerRF();
  // pinMode(POWER_PIN, OUTPUT);
  // pinMode(PULLDOWN_PIN, OUTPUT);
  // // pinMode(SQL_PIN, INPUT);
  // pinMode(PTT_PIN, OUTPUT);

  // digitalWrite(PTT_PIN, LOW);
  // digitalWrite(POWER_PIN, LOW);
  // digitalWrite(PULLDOWN_PIN, LOW);
  // delay(1000);
  // digitalWrite(PTT_PIN, HIGH);
  // digitalWrite(PULLDOWN_PIN, HIGH);
  // delay(500);
  if (boot)
  {
    SerialRF.begin(9600, SERIAL_8N1, SA868_RX_PIN, SA868_TX_PIN);
  }

  delay(1500);
  SerialRF.write("\r\n");
  RF_VERSION = SA868_getVERSION();
  log_d("RF Module Version %s", RF_VERSION);

  char str[200];
  if (config.sql_level > 8)
    config.sql_level = 8;
  if ((config.rf_type == RF_SR_1WV) || (config.rf_type == RF_SR_1WU) || (config.rf_type == RF_SR_1W350))
  {
    sprintf(str, "AT+DMOSETGROUP=%01d,%0.4f,%0.4f,%d,%01d,%d,0", config.band, config.freq_tx + ((float)config.offset_tx / 1000000), config.freq_rx + ((float)config.offset_rx / 1000000), config.tone_rx, config.sql_level, config.tone_tx);
    SerialRF.println(str);
    log_d("Write to SR_FRS: %s", str);
    if (SA868_waitResponse(data, "\r\n", 1000))
      log_d("%s", data.c_str());
    // Module auto power save setting
    SerialRF.println("AT+DMOAUTOPOWCONTR=1");
    if (SA868_waitResponse(data, "\r\n", 1000))
      log_d("%s", data.c_str());
    SerialRF.println("AT+DMOSETVOX=0");
    if (SA868_waitResponse(data, "\r\n", 1000))
      log_d("%s", data.c_str());
    SerialRF.println("AT+DMOSETMIC=6,0");
    if (SA868_waitResponse(data, "\r\n", 1000))
      log_d("%s", data.c_str());
    SerialRF.printf("AT+DMOSETVOLUME=%d\r\n", config.volume);
    if (SA868_waitResponse(data, "\r\n", 1000))
      log_d("%s", data.c_str());
  }
  else if ((config.rf_type == RF_SA868_VHF) || (config.rf_type == RF_SA868_UHF) || (config.rf_type == RF_SA868_350))
  {
    SerialRF.println("AT+DMOCONNECT");
    if (SA868_waitResponse(data, "\r\n", 1000))
      log_d("%s", data.c_str());
    sprintf(str, "AT+DMOSETGROUP=%01d,%0.4f,%0.4f,%04d,%01d,%04d\r\n", config.band, config.freq_tx, config.freq_rx, config.tone_tx, config.sql_level, config.tone_rx);
    SerialRF.print(str);
    log_d("Write to SA868: %s", str);
    if (SA868_waitResponse(data, "\r\n", 1000))
      log_d("%s", data.c_str());
    SerialRF.println("AT+SETTAIL=0");
    if (SA868_waitResponse(data, "\r\n", 1000))
      log_d("%s", data.c_str());
    SerialRF.println("AT+SETFILTER=1,1,1");
    if (SA868_waitResponse(data, "\r\n", 1000))
      log_d("%s", data.c_str());
    SerialRF.printf("AT+DMOSETVOLUME=%d\r\n", config.volume);
    if (SA868_waitResponse(data, "\r\n", 1000))
      log_d("%s", data.c_str());
  }
  else if ((config.rf_type == RF_SR_2WVS) || (config.rf_type == RF_SR_2WUS))
  {
    uint8_t flag = 0;  // Bit0:busy lock 0:OFF,1:ON Bit1:band 0:Wide,1:Narrow
    uint8_t flag1 = 0; // Bit0: Hi/Lo 0:2W,1:0.5W  Bit1:Middle 0:2W/0.5W 1:1W
    if (config.band == 0)
      flag |= 0x02;
    if (config.rf_power == 0)
      flag1 |= 0x02;

    SerialRF.printf("AT+DMOGRP=%0.5f,%0.5f,%04d,%04d,%d,%d\r\n", config.freq_rx, config.freq_tx, config.tone_rx, config.tone_tx, flag, flag1);
    if (SA868_waitResponse(data, "\r\n", 1000))
      log_d("%s", data.c_str());
    SerialRF.printf("AT+DMOSAV=1\r\n");
    if (SA868_waitResponse(data, "\r\n", 1000))
      log_d("%s", data.c_str());
    SerialRF.printf("AT+DMOVOL=%d\r\n", config.volume);
    if (SA868_waitResponse(data, "\r\n", 1000))
      log_d("%s", data.c_str());
    SerialRF.printf("AT+DMOVOX=0\r\n");
    if (SA868_waitResponse(data, "\r\n", 1000))
      log_d("%s", data.c_str());
    SerialRF.printf("AT+DMOFUN=%01d,2,1,0,0\r\n", config.sql_level);
  }
}

void RF_MODULE_CHECK()
{
  while (SerialRF.available() > 0)
    SerialRF.read();
  SerialRF.println("AT+DMOCONNECT");
  delay(100);
  if (SerialRF.available() > 0)
  {
    String ret = SerialRF.readString();
    if (ret.indexOf("DMOCONNECT") > 0)
    {
      SA818_Timeout = millis();
      // Serial.println(SerialRF.readString());
      log_d("RF Module %s Activate", RF_TYPE[config.rf_type]);
    }
  }
  else
  {
    log_d("RF Module %s sleep", RF_TYPE[config.rf_type]);
    digitalWrite(POWER_PIN, LOW);
    digitalWrite(PULLDOWN_PIN, LOW);
    delay(500);
    RF_MODULE(true);
  }
}

WiFiClient aprsClient;

boolean APRSConnect()
{
  // Serial.println("Connect TCP Server");
  String login = "";
  int cnt = 0;
  uint8_t con = aprsClient.connected();
  // Serial.println(con);
  if (con <= 0)
  {
    if (!aprsClient.connect(config.aprs_host, config.aprs_port)) // เชื่อมต่อกับเซิร์ฟเวอร์ TCP
    {
      // Serial.print(".");
      delay(100);
      cnt++;
      if (cnt > 50) // วนร้องขอการเชื่อมต่อ 50 ครั้ง ถ้าไม่ได้ให้รีเทิร์นฟังค์ชั่นเป็น False
        return false;
    }

