nakhonthai/ESP32APRS_T-TWR/src/main.cpp
    if (strcmp("NOCALL", config.aprs_mycall) == 0)
    {
      config.igate_en = false;
      return false;
    }

    // ขอเชื่อมต่อกับ aprsc
    if (strlen(config.igate_object) >= 3)
    {
      uint16_t passcode = aprsParse.passCode(config.igate_object);
      login = "user " + String(config.igate_object) + " pass " + String(passcode, DEC) + " vers ESP32APRS T-TWR+ " + String(VERSION) + " filter " + String(config.aprs_filter);
    }
    else
    {
      uint16_t passcode = aprsParse.passCode(config.aprs_mycall);
      if (config.aprs_ssid == 0)
        login = "user " + String(config.aprs_mycall) + " pass " + String(passcode, DEC) + " vers ESP32APRS T-TWR+ " + String(VERSION) + " filter " + String(config.aprs_filter);
      else
        login = "user " + String(config.aprs_mycall) + "-" + String(config.aprs_ssid) + " pass " + String(passcode, DEC) + " vers ESP32APRS T-TWR+ " + String(VERSION) + " filter " + String(config.aprs_filter);
    }
    aprsClient.println(login);
    // Serial.println(login);
    // Serial.println("Success");
    delay(500);
  }
  return true;
}

String NMEA;

bool powerEvent = true;

void powerSave()
{
  if (config.oled_enable)
  {
    display.dim(true);
  }
  else
  {
    // if (digitalRead(PWR_VDD))
    // {
    //   powerEvent = false;
    //   display.clearDisplay();
    //   display.display();
    //   // if (!config.trk_smartbeacon)
    //   //{
    //   digitalWrite(PWR_VDD, LOW);
    //   //}
    // }
  }
}

void powerWakeup()
{
  if (config.oled_enable)
  {
    display.dim(false);
  }
  else
  {
    // if (!digitalRead(PWR_VDD))
    // {
    //   powerEvent = true;
    //   digitalWrite(PWR_VDD, HIGH);
    //   delay(10);
    //   display.begin(SSD1306_SWITCHCAPVCC, 0x3C, false);
    //   display.clearDisplay();
    //   display.display();
    //   GPS_INIT();
    // }
  }
}

bool powerStatus()
{
  return 1;
  // digitalRead(PWR_VDD);
}

void setupPower()
{
  bool result = PMU.begin(Wire, AXP2101_SLAVE_ADDRESS, I2C_SDA, I2C_SCL);
  if (result == false)
  {
    while (1)
    {
      log_d("PMU is not online...");
      delay(500);
    }
  }

  // Set the minimum common working voltage of the PMU VBUS input,
  // below this value will turn off the PMU
  PMU.setVbusVoltageLimit(XPOWERS_AXP2101_VBUS_VOL_LIM_3V88);

  // Set the maximum current of the PMU VBUS input,
  // higher than this value will turn off the PMU
  PMU.setVbusCurrentLimit(XPOWERS_AXP2101_VBUS_CUR_LIM_2000MA);

  // Get the VSYS shutdown voltage
  uint16_t vol = PMU.getSysPowerDownVoltage();
  log_d("->  getSysPowerDownVoltage:%u\n", vol);

  // Set VSY off voltage as 2600mV , Adjustment range 2600mV ~ 3300mV
  PMU.setSysPowerDownVoltage(2600);

  //! DC1 ESP32S3 Core VDD , Don't change
  // PMU.setDC1Voltage(3300);

  //! DC3 Radio & Pixels VDD , Don't change
  PMU.setDC3Voltage(3400);

  //! ALDO2 MICRO TF Card VDD, Don't change
  PMU.setALDO2Voltage(3300);

  //! ALDO4 GNSS VDD, Don't change
  PMU.setALDO4Voltage(3300);

  //! BLDO1 MIC VDD, Don't change
  PMU.setBLDO1Voltage(3300);

  //! The following supply voltages can be controlled by the user
  // DC5 IMAX=2A
  // 1200mV
  // 1400~3700mV,100mV/step,24steps
  PMU.setDC5Voltage(3300);

  // ALDO1 IMAX=300mA
  // 500~3500mV, 100mV/step,31steps
  PMU.setALDO1Voltage(3300);

  // ALDO3 IMAX=300mA
  // 500~3500mV, 100mV/step,31steps
  PMU.setALDO3Voltage(3300);

  // BLDO2 IMAX=300mA
  // 500~3500mV, 100mV/step,31steps
  PMU.setBLDO2Voltage(3300);

  //! END

  // Turn on the power that needs to be used
  //! DC1 ESP32S3 Core VDD , Don't change
  // PMU.enableDC3();

  //! External pin power supply
  PMU.enableDC5();
  PMU.enableALDO1();
  PMU.enableALDO3();
  PMU.enableBLDO2();

  //! ALDO2 MICRO TF Card VDD
  PMU.enableALDO2();

  //! ALDO4 GNSS VDD
  PMU.enableALDO4();

  //! BLDO1 MIC VDD
  PMU.enableBLDO1();

  //! DC3 Radio & Pixels VDD
  PMU.enableDC3();

  // power off when not in use
  PMU.disableDC2();
  PMU.disableDC4();
  PMU.disableCPUSLDO();
  PMU.disableDLDO1();
  PMU.disableDLDO2();

  log_d("DCDC=======================================================================");
  log_d("DC1  : %s   Voltage:%u mV \n", PMU.isEnableDC1() ? "+" : "-", PMU.getDC1Voltage());
  log_d("DC2  : %s   Voltage:%u mV \n", PMU.isEnableDC2() ? "+" : "-", PMU.getDC2Voltage());
  log_d("DC3  : %s   Voltage:%u mV \n", PMU.isEnableDC3() ? "+" : "-", PMU.getDC3Voltage());
  log_d("DC4  : %s   Voltage:%u mV \n", PMU.isEnableDC4() ? "+" : "-", PMU.getDC4Voltage());
  log_d("DC5  : %s   Voltage:%u mV \n", PMU.isEnableDC5() ? "+" : "-", PMU.getDC5Voltage());
  log_d("ALDO=======================================================================");
  log_d("ALDO1: %s   Voltage:%u mV\n", PMU.isEnableALDO1() ? "+" : "-", PMU.getALDO1Voltage());
  log_d("ALDO2: %s   Voltage:%u mV\n", PMU.isEnableALDO2() ? "+" : "-", PMU.getALDO2Voltage());
  log_d("ALDO3: %s   Voltage:%u mV\n", PMU.isEnableALDO3() ? "+" : "-", PMU.getALDO3Voltage());
  log_d("ALDO4: %s   Voltage:%u mV\n", PMU.isEnableALDO4() ? "+" : "-", PMU.getALDO4Voltage());
  log_d("BLDO=======================================================================");
  log_d("BLDO1: %s   Voltage:%u mV\n", PMU.isEnableBLDO1() ? "+" : "-", PMU.getBLDO1Voltage());
  log_d("BLDO2: %s   Voltage:%u mV\n", PMU.isEnableBLDO2() ? "+" : "-", PMU.getBLDO2Voltage());
  log_d("===========================================================================");

  // Set the time of pressing the button to turn off
  PMU.setPowerKeyPressOffTime(XPOWERS_POWEROFF_4S);
  uint8_t opt = PMU.getPowerKeyPressOffTime();
  log_d("PowerKeyPressOffTime:");
  switch (opt)
  {
  case XPOWERS_POWEROFF_4S:
    log_d("4 Second");
    break;
  case XPOWERS_POWEROFF_6S:
    log_d("6 Second");
    break;
  case XPOWERS_POWEROFF_8S:
    log_d("8 Second");
    break;
  case XPOWERS_POWEROFF_10S:
    log_d("10 Second");
    break;
  default:
    break;
  }
  // Set the button power-on press time
  PMU.setPowerKeyPressOnTime(XPOWERS_POWERON_128MS);
  opt = PMU.getPowerKeyPressOnTime();
  log_d("PowerKeyPressOnTime:");
  switch (opt)
  {
  case XPOWERS_POWERON_128MS:
    log_d("128 Ms");
    break;
  case XPOWERS_POWERON_512MS:
    log_d("512 Ms");
    break;
  case XPOWERS_POWERON_1S:
    log_d("1 Second");
    break;
  case XPOWERS_POWERON_2S:
    log_d("2 Second");
    break;
  default:
    break;
  }

  Serial.println("===========================================================================");
  // It is necessary to disable the detection function of the TS pin on the board
  // without the battery temperature detection function, otherwise it will cause abnormal charging
  PMU.disableTSPinMeasure();

  // Enable internal ADC detection
  PMU.enableBattDetection();
  PMU.enableVbusVoltageMeasure();
  PMU.enableBattVoltageMeasure();
  PMU.enableSystemVoltageMeasure();

