nakhonthai/ESP32APRS_T-TWR/src/main.cpp
  /*
    The default setting is CHGLED is automatically controlled by the PMU.
  - XPOWERS_CHG_LED_OFF,
  - XPOWERS_CHG_LED_BLINK_1HZ,
  - XPOWERS_CHG_LED_BLINK_4HZ,
  - XPOWERS_CHG_LED_ON,
  - XPOWERS_CHG_LED_CTRL_CHG,
  * */
  PMU.setChargingLedMode(XPOWERS_CHG_LED_BLINK_1HZ);

  // Force add pull-up
  pinMode(PMU_IRQ, INPUT_PULLUP);
  // attachInterrupt(PMU_IRQ, setFlag, FALLING);

  // Disable all interrupts
  PMU.disableIRQ(XPOWERS_AXP2101_ALL_IRQ);
  // Clear all interrupt flags
  PMU.clearIrqStatus();
  // Enable the required interrupt function
  PMU.enableIRQ(
      XPOWERS_AXP2101_BAT_INSERT_IRQ | XPOWERS_AXP2101_BAT_REMOVE_IRQ |    // BATTERY
      XPOWERS_AXP2101_VBUS_INSERT_IRQ | XPOWERS_AXP2101_VBUS_REMOVE_IRQ |  // VBUS
      XPOWERS_AXP2101_PKEY_SHORT_IRQ | XPOWERS_AXP2101_PKEY_LONG_IRQ |     // POWER KEY
      XPOWERS_AXP2101_BAT_CHG_DONE_IRQ | XPOWERS_AXP2101_BAT_CHG_START_IRQ // CHARGE
  );

  // Set the precharge charging current
  PMU.setPrechargeCurr(XPOWERS_AXP2101_PRECHARGE_150MA);

  // Set constant current charge current limit
  //! Using inferior USB cables and adapters will not reach the maximum charging current.
  //! Please pay attention to add a suitable heat sink above the PMU when setting the charging current to 1A
  PMU.setChargerConstantCurr(XPOWERS_AXP2101_CHG_CUR_1000MA);

  // Set stop charging termination current
  PMU.setChargerTerminationCurr(XPOWERS_AXP2101_CHG_ITERM_150MA);

  // Set charge cut-off voltage
  PMU.setChargeTargetVoltage(XPOWERS_AXP2101_CHG_VOL_4V2);

  // Disable the PMU long press shutdown function
  PMU.disableLongPressShutdown();

  // Get charging target current
  const uint16_t currTable[] = {
      0, 0, 0, 0, 100, 125, 150, 175, 200, 300, 400, 500, 600, 700, 800, 900, 1000};
  uint8_t val = PMU.getChargerConstantCurr();
  log_d("Val = %d", val);
  log_d("Setting Charge Target Current : %d", currTable[val]);

  // Get charging target voltage
  const uint16_t tableVoltage[] = {
      0, 4000, 4100, 4200, 4350, 4400, 255};
  val = PMU.getChargeTargetVoltage();
  log_d("Setting Charge Target Voltage : %d", tableVoltage[val]);
}

void setupSDCard()
{
  // SPI Bus
  SPI.begin(SPI_SCK, SPI_MISO, SPI_MOSI);

  if (SD.begin(SD_CS, SPI))
  {
    uint8_t cardType = SD.cardType();
    if (cardType == CARD_NONE)
    {
      log_d("No SD_MMC card attached");
      return;
    }
    else
    {
      log_d("SD_MMC Card Type: ");
      if (cardType == CARD_MMC)
      {
        log_d("MMC");
      }
      else if (cardType == CARD_SD)
      {
        log_d("SDSC");
      }
      else if (cardType == CARD_SDHC)
      {
        log_d("SDHC");
      }
      else
      {
        log_d("UNKNOWN");
      }
      uint32_t cardSize = SD.cardSize() / (1024 * 1024);
      uint32_t cardTotal = SD.totalBytes() / (1024 * 1024);
      uint32_t cardUsed = SD.usedBytes() / (1024 * 1024);
      log_d("SD Card Size: %lu MB\n", cardSize);
      log_d("Total space: %lu MB\n", cardTotal);
      log_d("Used space: %lu MB\n", cardUsed);
    }
  }
}

long oledSleepTimeout = 0;
bool showDisp = false;
// uint8_t curTab=0;

char *htmlBuffer;
void setup()
{
  // htmlBuffer = (char*)ps_malloc(1000000);
  byte *ptr;
#ifdef BOARD_HAS_PSRAM
  pkgList = (pkgListType *)ps_malloc(sizeof(pkgListType) * PKGLISTSIZE);
  Telemetry = (TelemetryType *)malloc(sizeof(TelemetryType) * TLMLISTSIZE);
  txQueue = (txQueueType *)ps_malloc(sizeof(txQueueType) * PKGTXSIZE);
  // TNC2Raw = (int *)ps_malloc(sizeof(int) * PKGTXSIZE);
#else
  pkgList = (pkgListType *)malloc(sizeof(pkgListType) * PKGLISTSIZE);
  Telemetry = (TelemetryType *)malloc(sizeof(TelemetryType) * TLMLISTSIZE);
  txQueue = (txQueueType *)malloc(sizeof(txQueueType) * PKGTXSIZE);
  // TNC2Raw = (int *)malloc(sizeof(int) * PKGTXSIZE);
#endif

  memset(pkgList, 0, sizeof(pkgListType) * PKGLISTSIZE);
  memset(Telemetry, 0, sizeof(TelemetryType) * TLMLISTSIZE);
  memset(txQueue, 0, sizeof(txQueueType) * PKGTXSIZE);
  // memset(TNC2Raw, 0, sizeof(TNC2Raw) * PKGTXSIZE);

  pinMode(ENCODER_OK_PIN, INPUT_PULLUP);

  // Set up serial port
  Serial.begin(115200); // debug

  // Serial.println();
  log_d("Start ESP32IGate V%s", String(VERSION).c_str());
  // log_d("Push BOOT after 3 sec for Factory Default config.");
  log_d("Total heap: %d", ESP.getHeapSize());

  Wire.begin(I2C_SDA, I2C_SCL, 400000L);

  // Setup Power PMU AXP2101
  setupPower();
  setupSDCard();

  // by default, we'll generate the high voltage from the 3.3v line internally! (neat!)
  display.begin(SSD1306_SWITCHCAPVCC, 0x3C, false); // initialize with the I2C addr 0x3C (for the 128x64)
  // Initialising the UI will init the display too.
  // clear the display
  display.clearDisplay();
  display.setTextSize(1);
  display.setTextColor(WHITE);

  display.setTextSize(1);
  display.setFont(&FreeSansBold9pt7b);
  display.setCursor(0, 15);
  display.print("APRS");
  display.setCursor(55, 32);
  display.print("T-TWR+");
  display.drawYBitmap(0, 16, LOGO, 48, 48, WHITE);
  display.drawRoundRect(52, 16, 75, 22, 3, WHITE);

  display.setFont();
  display.setTextColor(WHITE);

  display.setCursor(55, 40);
  display.print("Version " + String(VERSION));
  display.setCursor(60, 55);
  display.print("Copy@2023");
  // display.drawLine(10, 30, 110, 30, WHITE);
  // display.setCursor(1, 40);
  // display.print("Push B Factory reset");
  // topBar(-100);
  display.display();

  if (!EEPROM.begin(EEPROM_SIZE))
  {
    log_d("failed to initialise EEPROM"); // delay(100000);
  }

#ifdef OLED
  delay(1000);
  // digitalWrite(LED_TX, HIGH);
  // display.setCursor(50, 50);
  // display.print("3 Sec");
  // display.display();
  // delay(1000);
  // digitalWrite(LED_RX, HIGH);
  // display.setCursor(40, 50);
  // display.print("        ");
  // display.display();
  // display.setCursor(50, 50);
  // display.print("2 Sec");
  // display.display();
  // delay(1000);
  // display.setCursor(40, 50);
  // display.print("        ");
  // display.display();
  // display.setCursor(50, 50);
  // display.print("1 Sec");
  // display.display();
#else
  delay(1000);
  digitalWrite(LED_TX, HIGH);
  delay(1000);
  digitalWrite(LED_RX, HIGH);
  delay(1000);
#endif
  if (digitalRead(ENCODER_OK_PIN) == LOW)
  {
    defaultConfig();
    log_d("Manual Default configure!");
#ifdef OLED
    display.clearDisplay();
    display.setCursor(10, 22);
    display.print("Factory Reset!");
    display.display();
#endif
    //   while (digitalRead(0) == LOW)
    //   {
    //     delay(500);
    //     digitalWrite(LED_TX, LOW);
    //     digitalWrite(LED_RX, LOW);
    //     delay(500);
    //     digitalWrite(LED_TX, HIGH);
    //     digitalWrite(LED_RX, HIGH);
    //   }
  }

  // ตรวจสอบคอนฟิกซ์ผิดพลาด
  ptr = (byte *)&config;
  EEPROM.readBytes(1, ptr, sizeof(Configuration));
  uint8_t chkSum = checkSum(ptr, sizeof(Configuration));
  log_d("EEPROM Check %0Xh=%0Xh(%dByte)\n", EEPROM.read(0), chkSum, sizeof(Configuration));
  if (EEPROM.read(0) != chkSum)
  {
    log_d("Config EEPROM Error!");
    display.clearDisplay();
    display.setCursor(12, 22);
    display.print("EEPROM Error!");
    display.setCursor(10, 42);
    display.print("Factory Default");
    display.display();
    defaultConfig();
  }

  if (config.bt_master == true)
  {
    // Create the BLE Device
    BLEDevice::init(config.bt_name);

