nakhonthai/ESP32APRS_T-TWR/src/main.cpp
    // Create the BLE Server
    pServer = BLEDevice::createServer();
    pServer->setCallbacks(new MyServerCallbacks());

    // Create the BLE Service
    BLEService *pService = pServer->createService(config.bt_uuid);

    // Create a BLE Characteristic
    pTxCharacteristic = pService->createCharacteristic(
        config.bt_uuid_tx,
        BLECharacteristic::PROPERTY_NOTIFY);
    pTxCharacteristic->addDescriptor(new BLE2902());

    BLECharacteristic *pRxCharacteristic = pService->createCharacteristic(
        config.bt_uuid_rx,
        BLECharacteristic::PROPERTY_WRITE);
    pRxCharacteristic->setCallbacks(new MyCallbacks());

    // Start the service
    pService->start();

    // Start advertising
    pServer->getAdvertising()->start();
  }

  RF_MODULE(true);

#ifdef OLED
  display.clearDisplay();
  display.setTextSize(1);
  display.display();
#endif

  // pkgListType pkgList[PKGLISTSIZE];
  // pkgList = (pkgListType*)ps_malloc(sizeof(pkgListType)*PKGLISTSIZE);

  log_d("Free heap: %d", ESP.getFreeHeap());
  log_d("Total PSRAM: %d", ESP.getPsramSize());
  log_d("Free PSRAM: %d", ESP.getFreePsram());
  // log_d("Used PSRAM: %d", ESP.getPsramSize() - ESP.getFreePsram());

  // enableLoopWDT();
  // enableCore0WDT();
  // enableCore1WDT();
  firstGpsTime = true;

  // Task 1
  xTaskCreatePinnedToCore(
      taskAPRS,        /* Function to implement the task */
      "taskAPRS",      /* Name of the task */
      8192,            /* Stack size in words */
      NULL,            /* Task input parameter */
      3,               /* Priority of the task */
      &taskAPRSHandle, /* Task handle. */
      0);              /* Core where the task should run */

  xTaskCreatePinnedToCore(
      taskGPS,        /* Function to implement the task */
      "taskGPS",      /* Name of the task */
      4096,           /* Stack size in words */
      NULL,           /* Task input parameter */
      2,              /* Priority of the task */
      &taskGpsHandle, /* Task handle. */
      0);             /* Core where the task should run */

  if (config.wifi_mode != 0)
  {
    // Task 2
    xTaskCreatePinnedToCore(
        taskNetwork,        /* Function to implement the task */
        "taskNetwork",      /* Name of the task */
        8192,               /* Stack size in words */
        NULL,               /* Task input parameter */
        2,                  /* Priority of the task */
        &taskNetworkHandle, /* Task handle. */
        1);                 /* Core where the task should run */
  }
  // Task 3
  xTaskCreatePinnedToCore(
      mainDisp,           /* Function to implement the task */
      "mainDisplay",      /* Name of the task */
      16384,              /* Stack size in words */
      NULL,               /* Task input parameter */
      1,                  /* Priority of the task */
      &mainDisplayHandle, /* Task handle. */
      1);                 /* Core where the task should run */

  xTaskCreatePinnedToCore(
      taskTNC,        /* Function to implement the task */
      "taskTNC",      /* Name of the task */
      8192,           /* Stack size in words */
      NULL,           /* Task input parameter */
      1,              /* Priority of the task */
      &taskTNCHandle, /* Task handle. */
      0);             /* Core where the task should run */
}

int pkgCount = 0;

float conv_coords(float in_coords)
{
  // Initialize the location.
  float f = in_coords;
  // Get the first two digits by turning f into an integer, then doing an integer divide by 100;
  // firsttowdigits should be 77 at this point.
  int firsttwodigits = ((int)f) / 100; // This assumes that f < 10000.
  float nexttwodigits = f - (float)(firsttwodigits * 100);
  float theFinalAnswer = (float)(firsttwodigits + nexttwodigits / 60.0);
  return theFinalAnswer;
}

void DD_DDDDDtoDDMMSS(float DD_DDDDD, int *DD, int *MM, int *SS)
{
  DD_DDDDD = abs(DD_DDDDD);
  *DD = (int)DD_DDDDD;
  *MM = (int)((DD_DDDDD - *DD) * 60);
  *SS = ((DD_DDDDD - *DD) * 60 - *MM) * 100;
}

String compress_position(double nowLat, double nowLng, int alt_feed, double course, uint16_t spdKnot, char table, char symbol, bool gps)
{
  String str_comp = "";
  String lat, lon;
  lat = deg2lat(nowLat);
  lon = deg2lon(nowLng);
  ESP_LOGE("GPS", "Aprs Compress");
  // Translate from semicircles to Base91 format
  char aprs_position[13];
  long latitude = semicircles((char *)lat.c_str(), (nowLat < 0));
  long longitude = semicircles((char *)lon.c_str(), (nowLat < 0));
  long ltemp = 1073741824L - latitude; // 90 degrees - latitude
  ESP_LOGE("GPS", "lat=%u lon=%u", latitude, longitude);
  memset(aprs_position, 0, sizeof(aprs_position));

  base91encode(ltemp, aprs_position);
  ltemp = 1073741824L + (longitude >> 1); // 180 degrees + longitude
  base91encode(ltemp, aprs_position + 4);
  // Encode heading
  uint8_t c = (uint8_t)(course / 4);
  // Scan lookup table to encode speed
  uint8_t s = (uint8_t)(log(spdKnot + 1) / log(1.08));
  if ((spdKnot <= 5) && (alt_feed > 0) && config.trk_altitude)
  {
    if (gps && config.trk_cst)
    {
      // Send Altitude
      aprs_position[11] = '!' + 0x30; // t current,GGA
      int alt = (int)alt_feed;
      int cs = (int)(log(alt) / log(1.002));
      c = (uint8_t)(cs / 91);
      s = (uint8_t)(cs - ((int)c * 91));
      if (s > 91)
        s = 91;
      aprs_position[9] = '!' + c;  // c
      aprs_position[10] = '!' + s; // s
    }
    else
    {
      // Send Range
      aprs_position[11] = '!' + 0x00; //
      aprs_position[9] = '{';         // c = {
      if (!config.rf_power)
      {
        s = 10;
      }
      else
      {
        s = 30;
      }
      aprs_position[10] = '!' + s; // s
    }
  }
  else
  {
    // Send course and speed
    aprs_position[9] = '!' + c;  // c
    aprs_position[10] = '!' + s; // s

    if (gps)
    {
      aprs_position[11] = '!' + 0x20 + 0x18 + 0x06; // t 0x20 1=current,0x18 11=RMC,0x06 110=Other tracker
    }
    else
    {
      aprs_position[11] = '!' + 0x00 + 0x18 + 0x06; // t
    }
  }
  aprs_position[12] = 0;
  // waveFlag = false;
  aprs_position[8] = symbol; // Symbol
  str_comp = String(table) + String(aprs_position);
  return str_comp;
}

String trk_gps_postion(String comment)
{
  String rawData = "";
  String lat, lon;
  double nowLat, nowLng;
  char rawTNC[300];
  char aprs_table, aprs_symbol;
  char timestamp[10];
  struct tm tmstruct;
  double dist, course, speed;
  time_t nowTime;

  memset(rawTNC, 0, sizeof(rawTNC));
  getLocalTime(&tmstruct, 5000);
  // if (config.mygps==true) {
  // if (gps.location.isValid())
  // {
  sprintf(timestamp, "%02d%02d%02d%02d", (tmstruct.tm_mon + 1), tmstruct.tm_mday, tmstruct.tm_hour, tmstruct.tm_min);
  time(&nowTime);
  // nowTime = gps.time.value();
  if (lastTimeStamp == 0)
    lastTimeStamp = nowTime;

  // lastTimeStamp=10000;
  // nowTime=lastTimeStamp+1800;
  time_t tdiff = nowTime - lastTimeStamp;

  // aprs_table = config.aprs_table;
  // aprs_symbol = config.aprs_symbol;
  if (config.trk_smartbeacon)
  {
    if (SB_SPEED < config.trk_lspeed)
    {
      aprs_table = config.trk_symstop[0];
      aprs_symbol = config.trk_symstop[1];
      SB_SPEED = 0;
    }
    else
    {
      aprs_table = config.trk_symmove[0];
      aprs_symbol = config.trk_symmove[1];
    }
  }
  else
  {
    aprs_table = config.trk_symbol[0];
    aprs_symbol = config.trk_symbol[1];
  }

  char object[10];
  memset(object, 0, 10);
  memcpy(object, config.trk_item, strlen(config.trk_item));
  object[9] = 0;

