nakhonthai/ESP32APRS_T-TWR/src/main.cpp
  if (gps.location.isValid())
  {
    nowLat = gps.location.lat();
    nowLng = gps.location.lng();

    uint16_t spdKnot;
    if (LastLng == 0 || LastLat == 0)
    {
      course = gps.course.deg();
      spdKnot = (uint16_t)gps.speed.knots();
    }
    else
    {
      dist = distance(LastLng, LastLat, nowLng, nowLat);
      course = direction(LastLng, LastLat, nowLng, nowLat);
      if (dist > 50.0F)
        dist = 0;
      if (tdiff > 10 && (nowTime > lastTimeStamp))
        speed = dist / ((double)tdiff / 3600);
      else
        speed = 0.0F;

      if (speed > 999)
        speed = 999.0F;
      // uint16_t spdMph=(uint16_t)(speed / 1.609344);
      spdKnot = (uint16_t)(speed * 0.53996F);
      if (spdKnot > 94)
        spdKnot = 0;
    }

    // lat = deg2lat(nowLat);
    // lon = deg2lon(nowLng);

    LastLat = nowLat;
    LastLng = nowLng;
    lastTimeStamp = nowTime;

    if (config.trk_compress)
    { // Compress DATA

      String compPosition = compress_position(nowLat, nowLng, gps.altitude.feet(), course, spdKnot, aprs_table, aprs_symbol, gps.location.isValid());
      // ESP_LOGE("GPS", "Compress=%s", aprs_position);
      if (strlen(object) >= 3)
      {
        // sprintf(rawTNC, "%s-%d>APTWR1,%s:)%s!%c%s", config.aprs_mycall, config.aprs_ssid, Path.c_str(), object, aprs_table, aprs_position);
        sprintf(rawTNC, ")%s!%s", object, compPosition.c_str());
      }
      else
      {
        sprintf(rawTNC, "!%s", compPosition.c_str());
      }
    }
    else
    { // None compress DATA
      int lat_dd, lat_mm, lat_ss, lon_dd, lon_mm, lon_ss;
      char lon_ew = 'E';
      char lat_ns = 'N';
      if (nowLat < 0)
        lat_ns = 'S';
      if (nowLng < 0)
        lon_ew = 'W';
      DD_DDDDDtoDDMMSS(nowLat, &lat_dd, &lat_mm, &lat_ss);
      DD_DDDDDtoDDMMSS(nowLng, &lon_dd, &lon_mm, &lon_ss);
      char csd_spd[8];
      memset(csd_spd, 0, sizeof(csd_spd));
      if (config.trk_cst)
      {
        sprintf(csd_spd, "%03d/%03d", (int)gps.course.deg(), (int)gps.speed.knots());
      }
      if (strlen(object) >= 3)
      {
        char object[10];
        memset(object, 0, 10);
        strcpy(object, config.trk_item);
        object[9] = 0;
        sprintf(rawTNC, ")%s!%02d%02d.%02d%c%c%03d%02d.%02d%c%c%s", object, lat_dd, lat_mm, lat_ss, lat_ns, aprs_table, lon_dd, lon_mm, lon_ss, lon_ew, aprs_symbol, csd_spd);
      }
      else
      {
        sprintf(rawTNC, "!%02d%02d.%02d%c%c%03d%02d.%02d%c%c%s", lat_dd, lat_mm, lat_ss, lat_ns, aprs_table, lon_dd, lon_mm, lon_ss, lon_ew, aprs_symbol, csd_spd);
      }
      if (config.trk_altitude)
      {

        if (gps.altitude.isValid())
        {
          char strAltitude[10];
          memset(strAltitude, 0, sizeof(strAltitude));
          sprintf(strAltitude, "/A=%06d", (int)gps.altitude.feet());
          strcat(rawTNC, strAltitude);
        }
      }
    }
  }
  else
  {
    sprintf(rawTNC, ">%s ", object);
    // sprintf(rawTNC, "%s-%d>APDRH1,%s:)%s_%s", config.aprs_mycall, config.aprs_ssid, Path.c_str(), object, timestamp);
    //  sprintf(rawTNC, "%s-%d>APBT01-1%s:>%s_%s", config.aprs_mycall, config.aprs_ssid, config.aprs_path, object, timestamp);
  }

  String tnc2Raw = "";
  char strtmp[300];
  if (config.trk_ssid == 0)
    sprintf(strtmp, "%s>APTWR", config.trk_mycall);
  else
    sprintf(strtmp, "%s-%d>APTWR", config.trk_mycall, config.trk_ssid);
  tnc2Raw = String(strtmp);
  if (config.trk_path[0] != 0)
  {
    tnc2Raw += ",";
    tnc2Raw += String(config.trk_path);
  }
  tnc2Raw += ":";
  tnc2Raw += String(rawTNC);
  tnc2Raw += comment + " " + String(config.trk_comment);
  return tnc2Raw;
}

String trk_fix_position(String comment)
{
  char strtmp[500], loc[100];
  String tnc2Raw = "";
  memset(strtmp, 0, sizeof(strtmp));
  memset(loc, 0, sizeof(loc));
  if (config.trk_compress)
  { // Compress DATA

    String compPosition = compress_position(config.trk_lat, config.trk_lon, (int)(config.trk_alt * 3.28F), 0, 0, config.trk_symbol[0], config.trk_symbol[1], true);
    // ESP_LOGE("GPS", "Compress=%s", aprs_position);
    if (strlen(config.trk_item) >= 3)
    {
      // sprintf(rawTNC, "%s-%d>APTWR1,%s:)%s!%c%s", config.aprs_mycall, config.aprs_ssid, Path.c_str(), object, aprs_table, aprs_position);
      sprintf(loc, ")%s!%s", config.trk_item, compPosition.c_str());
    }
    else
    {
      sprintf(loc, "!%s", compPosition.c_str());
    }
  }
  else
  {
    int lat_dd, lat_mm, lat_ss, lon_dd, lon_mm, lon_ss;

    char lon_ew = 'E';
    char lat_ns = 'N';
    if (config.trk_lat < 0)
      lat_ns = 'S';
    if (config.trk_lon < 0)
      lon_ew = 'W';

    DD_DDDDDtoDDMMSS(config.trk_lat, &lat_dd, &lat_mm, &lat_ss);
    DD_DDDDDtoDDMMSS(config.trk_lon, &lon_dd, &lon_mm, &lon_ss);

    if (strlen(config.trk_item) >= 3)
    {
      char object[10];
      memset(object, 0, 10);
      strcpy(object, config.trk_item);
      object[9] = 0;
      sprintf(loc, ")%s!%02d%02d.%02d%c%c%03d%02d.%02d%c%c", object, lat_dd, lat_mm, lat_ss, lat_ns, config.trk_symbol[0], lon_dd, lon_mm, lon_ss, lon_ew, config.trk_symbol[1]);
    }
    else
    {
      sprintf(loc, "!%02d%02d.%02d%c%c%03d%02d.%02d%c%c", lat_dd, lat_mm, lat_ss, lat_ns, config.trk_symbol[0], lon_dd, lon_mm, lon_ss, lon_ew, config.trk_symbol[1]);
    }

    if (config.trk_alt > 0)
    {
      char strAltitude[12];
      memset(strAltitude, 0, sizeof(strAltitude));
      sprintf(strAltitude, "/A=%06d", (int)(config.trk_alt * 3.28F));
      strcat(loc, strAltitude);
    }
  }

  if (config.trk_ssid == 0)
    sprintf(strtmp, "%s>APTWR", config.trk_mycall);
  else
    sprintf(strtmp, "%s-%d>APTWR", config.trk_mycall, config.trk_ssid);
  tnc2Raw = String(strtmp);
  if (config.trk_path[0] != 0)
  {
    tnc2Raw += ",";
    tnc2Raw += String(config.trk_path);
  }
  tnc2Raw += ":";
  tnc2Raw += String(loc);

  // if (config.trk_ssid == 0)
  //   sprintf(strtmp, "%s>APTWR", config.trk_mycall);
  // else
  //   sprintf(strtmp, "%s-%d>APTWR", config.trk_mycall, config.trk_ssid);
  // tnc2Raw = String(strtmp);
  // if (config.trk_path[0] != 0)
  // {
  //   tnc2Raw += ",";
  //   tnc2Raw += String(config.trk_path);
  // }
  // tnc2Raw += ":";
  // tnc2Raw += String(loc);
  // tnc2Raw += String(strAltitude);
  tnc2Raw += comment + " " + String(config.trk_comment);
  return tnc2Raw;
}

String igate_position(double lat, double lon, double alt, String comment)
{
  String tnc2Raw = "";
  int lat_dd, lat_mm, lat_ss, lon_dd, lon_mm, lon_ss;
  char strtmp[500], loc[100];
  char lon_ew = 'E';
  char lat_ns = 'N';
  if (lat < 0)
    lat_ns = 'S';
  if (lon < 0)
    lon_ew = 'W';
  memset(strtmp, 0, sizeof(strtmp));
  memset(loc, 0, sizeof(loc));
  DD_DDDDDtoDDMMSS(lat, &lat_dd, &lat_mm, &lat_ss);
  DD_DDDDDtoDDMMSS(lon, &lon_dd, &lon_mm, &lon_ss);
  char strAltitude[12];
  memset(strAltitude, 0, sizeof(strAltitude));
  if (alt > 0)
  {
    sprintf(strAltitude, "/A=%06d", (int)(alt * 3.28F));
  }
  if (strlen(config.igate_object) >= 3)
  {
    char object[10];
    memset(object, 0, 10);
    strcpy(object, config.igate_object);
    object[9] = 0;
    sprintf(loc, ")%s!%02d%02d.%02d%c%c%03d%02d.%02d%c%c", object, lat_dd, lat_mm, lat_ss, lat_ns, config.igate_symbol[0], lon_dd, lon_mm, lon_ss, lon_ew, config.igate_symbol[1]);
  }
  else
  {
    sprintf(loc, "!%02d%02d.%02d%c%c%03d%02d.%02d%c%c", lat_dd, lat_mm, lat_ss, lat_ns, config.igate_symbol[0], lon_dd, lon_mm, lon_ss, lon_ew, config.igate_symbol[1]);
  }
  if (config.aprs_ssid == 0)
    sprintf(strtmp, "%s>APTWR", config.aprs_mycall);
  else
    sprintf(strtmp, "%s-%d>APTWR", config.aprs_mycall, config.aprs_ssid);
  tnc2Raw = String(strtmp);
  if (config.igate_path[0] != 0)
  {
    tnc2Raw += ",";
    tnc2Raw += String(config.igate_path);
  }
  tnc2Raw += ":";
  tnc2Raw += String(loc);
  tnc2Raw += String(config.igate_phg) + String(strAltitude);
  tnc2Raw += comment + " " + String(config.igate_comment);
  return tnc2Raw;
}

