nakhonthai/ESP32APRS_T-TWR/src/main.cpp
String digi_position(double lat, double lon, double alt, String comment)
{
  String tnc2Raw = "";
  int lat_dd, lat_mm, lat_ss, lon_dd, lon_mm, lon_ss;
  char strtmp[500], loc[100];
  char lon_ew = 'E';
  char lat_ns = 'N';
  if (lat < 0)
    lat_ns = 'S';
  if (lon < 0)
    lon_ew = 'W';
  memset(strtmp, 0, sizeof(strtmp));
  memset(loc, 0, sizeof(loc));
  DD_DDDDDtoDDMMSS(lat, &lat_dd, &lat_mm, &lat_ss);
  DD_DDDDDtoDDMMSS(lon, &lon_dd, &lon_mm, &lon_ss);
  char strAltitude[12];
  memset(strAltitude, 0, sizeof(strAltitude));
  if (alt > 0)
  {
    sprintf(strAltitude, "/A=%06d", (int)(alt * 3.28F));
  }
  sprintf(loc, "!%02d%02d.%02d%c%c%03d%02d.%02d%c%c", lat_dd, lat_mm, lat_ss, lat_ns, config.digi_symbol[0], lon_dd, lon_mm, lon_ss, lon_ew, config.digi_symbol[1]);
  if (config.digi_ssid == 0)
    sprintf(strtmp, "%s>APTWR", config.digi_mycall);
  else
    sprintf(strtmp, "%s-%d>APTWR", config.digi_mycall, config.digi_ssid);
  tnc2Raw = String(strtmp);
  if (config.digi_path[0] != 0)
  {
    tnc2Raw += ",";
    tnc2Raw += String(config.digi_path);
  }
  tnc2Raw += ":";
  tnc2Raw += String(loc);
  tnc2Raw += String(config.digi_phg) + String(strAltitude);
  tnc2Raw += comment + " " + String(config.digi_comment);
  return tnc2Raw;
}

int packet2Raw(String &tnc2, AX25Msg &Packet)
{
  if (Packet.len < 5)
    return 0;
  tnc2 = String(Packet.src.call);
  if (Packet.src.ssid > 0)
  {
    tnc2 += String(F("-"));
    tnc2 += String(Packet.src.ssid);
  }
  tnc2 += String(F(">"));
  tnc2 += String(Packet.dst.call);
  if (Packet.dst.ssid > 0)
  {
    tnc2 += String(F("-"));
    tnc2 += String(Packet.dst.ssid);
  }
  for (int i = 0; i < Packet.rpt_count; i++)
  {
    tnc2 += String(",");
    tnc2 += String(Packet.rpt_list[i].call);
    if (Packet.rpt_list[i].ssid > 0)
    {
      tnc2 += String("-");
      tnc2 += String(Packet.rpt_list[i].ssid);
    }
    if (Packet.rpt_flags & (1 << i))
      tnc2 += "*";
  }
  tnc2 += String(F(":"));
  tnc2 += String((const char *)Packet.info);
  // tnc2 += String("\n");

  // #ifdef DEBUG_TNC
  //     Serial.printf("[%d] ", ++pkgTNC_count);
  //     Serial.print(tnc2);
  // #endif
  return tnc2.length();
}

long sendTimer = 0;
bool AFSKInitAct = false;
int btn_count = 0;
long timeCheck = 0;

void loop()
{
  vTaskDelay(10 / portTICK_PERIOD_MS);

  if (ESP.getFreeHeap() < 60000)
    ESP.restart();

  if (config.bt_master)
  {
    //   if (BTdeviceConnected) {
    //       pTxCharacteristic->setValue(&BTtxValue, 1);
    //       pTxCharacteristic->notify();
    //       BTtxValue++;
    // 	delay(10); // bluetooth stack will go into congestion, if too many packets are sent
    // }

    // disconnecting
    if (!BTdeviceConnected && BToldDeviceConnected)
    {
      delay(500);                  // give the bluetooth stack the chance to get things ready
      pServer->startAdvertising(); // restart advertising
      Serial.println("start advertising");
      BToldDeviceConnected = BTdeviceConnected;
    }
    // connecting
    if (BTdeviceConnected && !BToldDeviceConnected)
    {
      // do stuff here on connecting
      BToldDeviceConnected = BTdeviceConnected;
    }
  }

  if (digitalRead(0) == LOW)
  {
    btn_count++;
    if (btn_count > 1000) // Push BOOT 10sec
    {
      // digitalWrite(LED_PIN, HIGH);
      //  digitalWrite(LED_TX_PIN, HIGH);
    }
  }
  else
  {
    if (btn_count > 0)
    {
      // Serial.printf("btn_count=%dms\n", btn_count * 10);
      if (btn_count > 1000) // Push BOOT 10sec to Factory Default
      {
        // digitalWrite(LED_RX, LOW);
        // digitalWrite(LED_TX, LOW);
        // defaultConfig();
        log_d("SYSTEM REBOOT NOW!");
        // esp_restart();
      }
      else
      {
        EVENT_TX_POSITION = 1;
        //     showDisp=true;
        //     if( oledSleepTimeout>0){
        //     curTab++;
        //     if(curTab>3) curTab=0;
        //     }
        //     log_d("curTab: %d",curTab);
      }
      btn_count = 0;
    }
  }

  if (millis() > timeCheck)
  {
    // log_d("taskAPRS: %d mS\ttaskNetwork: %d mS\ttaskGUI: %d mS\n", timeAprs, timeNetwork, timeGui);
    timeCheck = millis() + 1000;
    // if (ESP.getFreeHeap() < 60000)
    //     esp_restart();
    // Serial.println(String(ESP.getFreeHeap()));
    // Popup Display
    // if (dispBuffer.getCount() > 0)
    // {
    //     if (millis() > timeHalfSec)
    //     {
    //         char tnc2[300];
    //         dispBuffer.pop(&tnc2);
    //         dispWindow(String(tnc2), 0, false);
    //     }
    // }
    // else
    // {
    //     // Sleep display
    //     if (millis() > timeHalfSec)
    //     {
    //         if (timeHalfSec > 0)
    //         {
    //             timeHalfSec = 0;
    //             oledSleepTimeout = millis() + (config.oled_timeout * 1000);
    //         }
    //         else
    //         {
    //             if (millis() > oledSleepTimeout && oledSleepTimeout > 0)
    //             {
    //                 oledSleepTimeout = 0;
    //                 display.clearDisplay();
    //                 display.display();
    //             }
    //         }
    //     }
    // }
  }
}

String sendIsAckMsg(String toCallSign, int msgId)
{
  char str[300];
  char call[11];
  int i;
  memset(&call[0], 0, 11);
  sprintf(call, "%s-%d", config.aprs_mycall, config.aprs_ssid);
  strcpy(&call[0], toCallSign.c_str());
  i = strlen(call);
  for (; i < 9; i++)
    call[i] = 0x20;
  memset(&str[0], 0, 300);

  sprintf(str, "%s-%d>APE32I%s::%s:ack%d", config.aprs_mycall, config.aprs_ssid, VERSION, call, msgId);
  return String(str);
}

void sendIsPkg(char *raw)
{
  char str[500];
  sprintf(str, "%s-%d>APE32I%s:%s", config.aprs_mycall, config.aprs_ssid, VERSION, raw);
  String tnc2Raw = String(str);
  if (aprsClient.connected())
    aprsClient.println(tnc2Raw); // Send packet to Inet
  if (config.rf_en && config.digi_en)
    pkgTxPush(str, strlen(str), 0);
}

void sendIsPkgMsg(char *raw)
{
  char str[300];
  char call[11];
  int i;
  memset(&call[0], 0, 11);
  if (config.aprs_ssid == 0)
    sprintf(call, "%s", config.aprs_mycall);
  else
    sprintf(call, "%s-%d", config.aprs_mycall, config.aprs_ssid);
  i = strlen(call);
  for (; i < 9; i++)
    call[i] = 0x20;

