nakhonthai/ESP32APRS_T-TWR/src/main.cpp
  if (config.aprs_ssid == 0)
    sprintf(str, "%s>APE32I::%s:%s", config.aprs_mycall, call, raw);
  else
    sprintf(str, "%s-%d>APE32I::%s:%s", config.aprs_mycall, config.aprs_ssid, call, raw);

  String tnc2Raw = String(str);
  if (aprsClient.connected())
    aprsClient.println(tnc2Raw); // Send packet to Inet
  if (config.rf_en && config.digi_en)
    pkgTxPush(str, strlen(str), 0);
  // APRS_sendTNC2Pkt(tnc2Raw); // Send packet to RF
}

void taskGPS(void *pvParameters)
{
  unsigned long gpsTickInterval;
  GPS_INIT();
  for (;;)
  {
    vTaskDelay(100 / portTICK_PERIOD_MS);

    while (SerialGPS.available())
      gps.encode(SerialGPS.read());

    if (firstGpsTime && gps.time.isValid())
    {
      if (gps.time.isUpdated())
      {
        time_t timeGps = getGpsTime();
        if (timeGps > 1653152400 && timeGps < 2347462800)
        {
          setTime(timeGps);
          time_t rtc = timeGps;
          timeval tv = {rtc, 0};
          timezone tz = {TZ_SEC + DST_MN, 0};
          settimeofday(&tv, &tz);
#ifdef DEBUG
          log_d("\nSET GPS Timestamp = %u Year=%d\n", timeGps, year());
#endif
          // firstGpsTime = false;
          firstGpsTime = false;
          if (startTime == 0)
            startTime = now();
        }
        else
        {
          startTime = 0;
        }
      }
    }
  }
}

extern cppQueue adcq;
void taskTNC(void *pvParameters)
{
  unsigned long timer, result;
  for (;;)
  {
    // timer=micros();
    if (AFSKInitAct == true)
      AFSK_Poll(true, config.rf_power);
    // result=micros()-timer;
    // log_d("AFSK_Poll timer = %.2f mS",(float)result/1000);
    vTaskDelay(10 / portTICK_PERIOD_MS);
  }
}

long timeSlot;
void taskAPRS(void *pvParameters)
{
  //	long start, stop;
  char *raw;
  char *str;
  // bool firstGpsTime = true;
  unsigned long tickInterval;
  unsigned long iGatetickInterval;
  unsigned long DiGiInterval;

  PacketBuffer.clean();

  APRS_init();
  APRS_setCallsign(config.aprs_mycall, config.aprs_ssid);
  APRS_setPath1(config.igate_path, 1);
  APRS_setPreamble(300);
  APRS_setTail(0);
  sendTimer = millis() - (config.igate_interval * 1000) + 30000;
  igateTLM.TeleTimeout = millis() + 60000; // 1Min
  AFSKInitAct = true;
  timeSlot = millis();
  timeAprs = 0;
  afskSetHPF(config.audio_hpf);
  afskSetBPF(config.audio_bpf);
  // AFSK_TimerEnable(true);

  unsigned long timeAprsOld = millis();
  unsigned long gpsTimeout;

  // tx_counter = igate_tx_counter = digi_tx_counter = millis();
  // tx_interval = igate_tx_interval = digi_tx_interval = millis() + 5000;
  DiGiInterval = iGatetickInterval = millis() + 15000;
  tx_interval = config.trk_interval;
  tx_counter = tx_interval - 10;
  log_d("Task APRS has been start");
  for (;;)
  {
    unsigned long now = millis();
    timeAprs = now - timeAprsOld;
    timeAprsOld = now;
    // wdtSensorTimer = now;
    time_t timeStamp;
    time(&timeStamp);
    vTaskDelay(10 / portTICK_PERIOD_MS);
    // serviceHandle();

    if (AFSKInitAct == true)
    {
    }

    if (config.rf_en)
    { // RF Module enable
      // SEND RF in time slot
      if (now > (timeSlot + 10))
      {
        // Transmit in timeslot if enabled
        if (config.gpio_sql_pin > -1)
        { // Set SQL pin
          if (!digitalRead(config.gpio_sql_pin))
          { // RX State Fail
            if (pkgTxSend())
              timeSlot = millis() + config.tx_timeslot; // Tx Time Slot >2sec.
            else
              timeSlot = millis() + 3000;
          }
          else
          {
            timeSlot = millis() + 1500;
          }
        }
        else
        {
          if (pkgTxSend())
            timeSlot = millis() + config.tx_timeslot; // Tx Time Slot > 2sec.
          else
            timeSlot = millis() + 3000;
        }
      }
    }

    if (config.trk_en)
    { // TRACKER MODE

      if (millis() > tickInterval)
      {
        tickInterval = millis() + 1000;

        tx_counter++;
        // Check interval timeout
        if (config.trk_smartbeacon && config.trk_gps)
        {
          if (tx_counter > tx_interval)
          {
            if (tx_counter > config.trk_mininterval)
              EVENT_TX_POSITION = 4;
          }
          else
          {
            if (tx_counter >= (tx_interval + 5))
            {
              EVENT_TX_POSITION = 5;
            }
          }
        }
        else if (tx_counter > tx_interval)
        {
          EVENT_TX_POSITION = 6;
          tx_interval = config.trk_interval;
        }

        if (config.trk_gps && gps.speed.isValid() && gps.location.isValid() && gps.course.isValid())
        {
          SB_SPEED_OLD = SB_SPEED;
          if (gps.speed.isUpdated())
            SB_SPEED = (unsigned char)gps.speed.kmph();
          if (gps.course.isUpdated())
            SB_HEADING = (int16_t)gps.course.deg();
          if (config.trk_smartbeacon) // SMART BEACON CAL
          {
            if (SB_SPEED < config.trk_lspeed && SB_SPEED_OLD > config.trk_lspeed) // Speed slow down to STOP
            {                                                                     // STOPING
              SB_SPEED_OLD = 0;
              if (tx_counter > config.trk_mininterval)
                EVENT_TX_POSITION = 7;
              tx_interval = config.trk_slowinterval;
            }
            else
            {
              smartbeacon();
            }
          }
          else if (tx_counter > tx_interval)
          { // send gps location
            EVENT_TX_POSITION = 8;
            tx_interval = config.trk_interval;
          }
        }
      }

      if (EVENT_TX_POSITION > 0)
      {
        powerWakeup();
        String rawData;
        String cmn = "";
        if (config.trk_sat)
          cmn += "SAT:" + String(gps.satellites.value());
        if (config.trk_bat)
        {
          if (config.trk_sat)
            cmn += ",";
          // cmn += "BAT:" + String((float)PMU.getBattVoltage() / 1000, 1) + "V";
          cmn += "BAT:" + String(vbat, 1) + "V";
        }
        if (config.trk_gps) // TRACKER by GPS
        {
          rawData = trk_gps_postion(cmn);
        }
        else // TRACKER by FIX position
        {
          rawData = trk_fix_position(cmn);
        }

