nakhonthai/ESP32APRS_T-TWR/src/main.cpp
        log_d("TRACKER RAW: %s\n", rawData.c_str());
        log_d("TRACKER EVENT_TX_POSITION=%d\t INTERVAL=%d\n", EVENT_TX_POSITION, tx_interval);
        tx_counter = 0;
        EVENT_TX_POSITION = 0;
        last_heading = SB_HEADING;

        if (config.trk_loc2rf)
        { // TRACKER SEND TO RF
          char *rawP = (char *)malloc(rawData.length());
          memcpy(rawP, rawData.c_str(), rawData.length());
          // rawData.toCharArray(rawP, rawData.length());
          pkgTxPush(rawP, rawData.length(), 0);
          free(rawP);
        }
        if (config.trk_loc2inet)
        { // TRACKER SEND TO APRS-IS
          if (aprsClient.connected())
          {
            aprsClient.println(rawData); // Send packet to Inet
          }
        }        
      }
    }

    // if (config.tnc_telemetry)
    // {
    //     if (igateTLM.TeleTimeout < millis())
    //     {
    //         igateTLM.TeleTimeout = millis() + 600000; // 10Min
    //         if ((igateTLM.Sequence % 6) == 0)
    //         {
    //             sendIsPkgMsg((char *)&PARM[0]);
    //             sendIsPkgMsg((char *)&UNIT[0]);
    //             sendIsPkgMsg((char *)&EQNS[0]);
    //         }
    //         char rawTlm[100];
    //         if (config.aprs_ssid == 0)
    //             sprintf(rawTlm, "%s>APE32I:T#%03d,%d,%d,%d,%d,%d,00000000", config.aprs_mycall, igateTLM.Sequence, igateTLM.RF2INET, igateTLM.INET2RF, igateTLM.RX, igateTLM.TX, igateTLM.DROP);
    //         else
    //             sprintf(rawTlm, "%s-%d>APE32I:T#%03d,%d,%d,%d,%d,%d,00000000", config.aprs_mycall, config.aprs_ssid, igateTLM.Sequence, igateTLM.RF2INET, igateTLM.INET2RF, igateTLM.RX, igateTLM.TX, igateTLM.DROP);

    //         if (aprsClient.connected())
    //             aprsClient.println(String(rawTlm)); // Send packet to Inet
    //         if (config.tnc && config.tnc_digi)
    //             pkgTxPush(rawTlm, 0);
    //         // APRS_sendTNC2Pkt(String(rawTlm)); // Send packet to RF
    //         igateTLM.Sequence++;
    //         if (igateTLM.Sequence > 999)
    //             igateTLM.Sequence = 0;
    //         igateTLM.DROP = 0;
    //         igateTLM.INET2RF = 0;
    //         igateTLM.RF2INET = 0;
    //         igateTLM.RX = 0;
    //         igateTLM.TX = 0;
    //         // client.println(raw);
    //     }
    // }

    // LOAD DATA incomming
    bool newIGatePkg = false;
    bool newDigiPkg = false;
    if (PacketBuffer.getCount() > 0)
    {
      String tnc2;
      // นำข้อมูลแพ็จเกจจาก TNC ออกจากคิว
      PacketBuffer.pop(&incomingPacket);
      // igateProcess(incomingPacket);
      packet2Raw(tnc2, incomingPacket);
      newIGatePkg = true;
      newDigiPkg = true;
      if (config.bt_master)
      { // Output TNC2RAW to BT Serial
        // SerialBT.println(tnc2);
        if ((config.bt_mode == 1) && BTdeviceConnected)
        {
          char *rawP = (char *)malloc(tnc2.length());
          memcpy(rawP, tnc2.c_str(), tnc2.length());
          pTxCharacteristic->setValue((uint8_t *)rawP, tnc2.length());
          pTxCharacteristic->notify();
          free(rawP);
        }
      }

      log_d("RX: %s", tnc2.c_str());

      // SerialBT.println(tnc2);
      uint16_t type = pkgType((char *)incomingPacket.info);
      char call[11];
      if (incomingPacket.src.ssid > 0)
        sprintf(call, "%s-%d", incomingPacket.src.call, incomingPacket.src.ssid);
      else
        sprintf(call, "%s", incomingPacket.src.call);

      char *rawP = (char *)malloc(tnc2.length());
      memcpy(rawP, tnc2.c_str(), tnc2.length());
      int idx = pkgListUpdate(call, rawP, type, 0);
      free(rawP);
      if (idx > -1)
      {

        if (config.rx_display && config.dispRF && (type & config.dispFilter))
        {
          pushTNC2Raw(idx);
          log_d("RF_putQueueDisp:[pkgList_idx=%d,Type=%d] %s\n", idx, type, call);
        }
      }

      lastPkg = true;
      lastPkgRaw = tnc2;
      // ESP_BT.println(tnc2);
      status.allCount++;
    }

    // IGate Process
    if (config.igate_en)
    {
      // IGATE Position
      if (config.igate_bcn)
      {
        if (millis() > iGatetickInterval)
        {

          String rawData = "";
          if (config.igate_gps)
          { // IGATE Send GPS position
            if (gps.location.isValid())
              rawData = igate_position(gps.location.lat(), gps.location.lng(), gps.altitude.meters(), "");
          }
          else
          { // IGATE Send fix position
            rawData = igate_position(config.igate_lat, config.igate_lon, config.igate_alt, "");
          }
          if (rawData != "")
          {
            iGatetickInterval = millis() + (config.igate_interval * 1000);
            log_d("IGATE_POSITION: %s", rawData.c_str());
            if (config.igate_loc2rf)
            { // IGATE SEND POSITION TO RF
              char *rawP = (char *)malloc(rawData.length());
              // rawData.toCharArray(rawP, rawData.length());
              memcpy(rawP, rawData.c_str(), rawData.length());
              pkgTxPush(rawP, rawData.length(), 0);
              free(rawP);
            }
            if (config.igate_loc2inet)
            { // IGATE SEND TO APRS-IS
              if (aprsClient.connected())
              {
                aprsClient.println(rawData); // Send packet to Inet
              }
            }
          }
        }
      }
      // IGATE send to inet
      if (newIGatePkg)
      {
        newIGatePkg = false;
        if (config.rf2inet && aprsClient.connected())
        {
          int ret = 0;
          uint16_t type = pkgType((const char *)&incomingPacket.info[0]);
          // IGate Filter RF->INET
          if ((type & config.rf2inetFilter))
            ret = igateProcess(incomingPacket);
          if (ret == 0)
          {
            status.dropCount++;
            igateTLM.DROP++;
          }
          else
          {
            status.rf2inet++;
            igateTLM.RF2INET++;
            igateTLM.TX++;
#ifdef DEBUG
            // printTime();
            // log_d("RF->INET: ");
            // log_d("%s\n", tnc2.c_str());
#endif
          }
        }
      }
    }

    // Digi Repeater Process
    if (config.digi_en)
    {
      // DIGI Position
      if (config.digi_bcn)
      {
        if (millis() > DiGiInterval)
        {

