nakhonthai/ESP32APRS_T-TWR/src/main.cpp
          String rawData;
          if (config.digi_gps)
          { // DIGI Send GPS position
            if (gps.location.isValid())
              rawData = digi_position(gps.location.lat(), gps.location.lng(), gps.altitude.meters(), "");
          }
          else
          { // DIGI Send fix position
            rawData = digi_position(config.digi_lat, config.digi_lon, config.digi_alt, "");
          }
          if (rawData != "")
          {
            DiGiInterval = millis() + (config.digi_interval * 1000);
            log_d("DIGI_POSITION: %s", rawData.c_str());
            if (config.digi_loc2rf)
            { // DIGI SEND POSITION TO RF
              char *rawP = (char *)malloc(rawData.length());
              // rawData.toCharArray(rawP, rawData.length());
              memcpy(rawP, rawData.c_str(), rawData.length());
              pkgTxPush(rawP, rawData.length(), 0);
              free(rawP);
            }
            if (config.digi_loc2inet)
            { // DIGI SEND TO APRS-IS
              if (aprsClient.connected())
              {
                aprsClient.println(rawData); // Send packet to Inet
              }
            }
          }
        }
      }

      // Repeater packet
      if (newDigiPkg)
      {
        newDigiPkg = false;
        uint16_t type = pkgType((const char *)&incomingPacket.info[0]);
        // Digi repeater filter
        if ((type & config.digiFilter))
        {
          int dlyFlag = digiProcess(incomingPacket);
          if (dlyFlag > 0)
          {
            int digiDelay;
            status.digiCount++;
            if (dlyFlag == 1)
            {
              digiDelay = 0;
            }
            else
            {
              if (config.digi_delay == 0)
              { // Auto mode
                if (digiCount > 20)
                  digiDelay = random(5000);
                else if (digiCount > 10)
                  digiDelay = random(3000);
                else if (digiCount > 0)
                  digiDelay = random(1500);
                else
                  digiDelay = random(500);
              }
              else
              {
                digiDelay = random(config.digi_delay);
              }
            }

            String digiPkg;
            packet2Raw(digiPkg, incomingPacket);
            log_d("DIGI_REPEAT: %s", digiPkg.c_str());
            log_d("DIGI delay=%d ms.", digiDelay);
            char *rawP = (char *)malloc(digiPkg.length());
            // digiPkg.toCharArray(rawP, digiPkg.length());
            memcpy(rawP, digiPkg.c_str(), digiPkg.length());
            pkgTxPush(rawP, digiPkg.length(), digiDelay);
            free(rawP);
          }
        }
      }
    }
  }
}

int mqttRetry = 0;
long wifiTTL = 0;
WiFiMulti wifiMulti;

void taskNetwork(void *pvParameters)
{
  int c = 0;
  log_d("Task Network has been start");

  if (config.wifi_mode == WIFI_STA_FIX)
  { /**< WiFi station mode */
    WiFi.mode(WIFI_MODE_STA);
  }
  else if (config.wifi_mode == WIFI_AP_FIX)
  { /**< WiFi soft-AP mode */
    WiFi.mode(WIFI_MODE_AP);
  }
  if (config.wifi_mode == WIFI_AP_STA_FIX)
  { /**< WiFi station + soft-AP mode */
    WiFi.mode(WIFI_MODE_APSTA);
  }
  else
  {
    WiFi.mode(WIFI_MODE_NULL);
  }

  if (config.wifi_mode & WIFI_STA_FIX)
  {
    wifiMulti.addAP(config.wifi_ssid, config.wifi_pass);
    wifiMulti.addAP("APRSTH", "aprsthnetwork");
    WiFi.setTxPower((wifi_power_t)config.wifi_power);
    WiFi.setHostname("ESP32APRS_T-TWR");
  }

  if (config.wifi_mode & WIFI_AP_FIX)
  {
    // กำหนดค่าการทำงานไวไฟเป็นแอสเซสพ้อย
    WiFi.softAP(config.wifi_ap_ssid, config.wifi_ap_pass); // Start HOTspot removing password will disable security
    WiFi.softAPConfig(local_IP, gateway, subnet);
    Serial.print("Access point running. IP address: ");
    Serial.print(WiFi.softAPIP());
    Serial.println("");
    webService();
  }

  if (wifiMulti.run() == WL_CONNECTED)
  {
    // Serial.println("");
    log_d("Wi-Fi CONNECTED!");
    log_d("IP address: %s", WiFi.localIP().toString().c_str());
    webService();
    NTP_Timeout = millis() + 2000;
  }

  pingTimeout = millis() + 10000;
  unsigned long timeNetworkOld = millis();
  timeNetwork = 0;
  for (;;)
  {
    unsigned long now = millis();
    timeNetwork = now - timeNetworkOld;
    timeNetworkOld = now;
    // wdtNetworkTimer = millis();
    vTaskDelay(10 / portTICK_PERIOD_MS);
    if (WiFi.status() == WL_CONNECTED)
    {
      serviceHandle();

      if (millis() > NTP_Timeout)
      {
        NTP_Timeout = millis() + 86400000;
        // Serial.println("Config NTP");
        // setSyncProvider(getNtpTime);
        log_d("Contacting Time Server\n");
        configTime(3600 * config.timeZone, 0, config.ntp_host);
        vTaskDelay(1000 / portTICK_PERIOD_MS);
        time_t systemTime;
        time(&systemTime);
        setTime(systemTime);
        if (systemUptime == 0)
        {
          systemUptime = time(NULL);
        }
        pingTimeout = millis() + 2000;
        if (config.vpn)
        {
          if (!wireguard_active())
          {
            log_d("Setup Wiregurad VPN!");
            wireguard_setup();
          }
        }
      }

      if (config.igate_en)
      {
        if (aprsClient.connected() == false)
        {
          APRSConnect();
        }
        else
        {
          if (aprsClient.available())
          {
            pingTimeout = millis() + 300000;                // Reset ping timout
            String line = aprsClient.readStringUntil('\n'); // อ่านค่าที่ Server ตอบหลับมาทีละบรรทัด
#ifdef DEBUG_IS
            printTime();
            Serial.print("APRS-IS ");
            Serial.println(line);
#endif
            status.isCount++;
            int start_val = line.indexOf(">", 0); // หาตำแหน่งแรกของ >
            if (start_val > 3)
            {
              // if (config.dispINET == true){
              //     if(!dispBuffer.isFull()) dispBuffer.push(line.c_str());
              // }
#ifdef BOARD_HAS_PSRAM
              // char *raw = (char *)malloc(line.length() + 1);
#else
              char *raw = (char *)malloc(line.length() + 1);
#endif
              String src_call = line.substring(0, start_val);
              String msg_call = "::" + src_call;

              status.allCount++;
              status.rxCount++;
              igateTLM.RX++;
              //               if (config.rf_en && config.inet2rf)
              //               {
              //                 if (line.indexOf(msg_call) <= 0) // src callsign = msg callsign ไม่ใช่หัวข้อโทรมาตร
              //                 {
              //                   if (line.indexOf(":T#") < 0) // ไม่ใช่ข้อความโทรมาตร
              //                   {
              //                     if (line.indexOf("::") > 0) // ข้อความเท่านั้น
              //                     {                           // message only
              //                       char *rawP = (char *)malloc(line.length());
              //                       // line.toCharArray(rawP, line.length());
              //                       memcpy(rawP, line.c_str(), line.length());
              //                       pkgTxPush(rawP, line.length(), 0);
              //                       free(rawP);
              //                       // APRS_sendTNC2Pkt(line); // Send out RF by TNC build in
              //                       //  tncTxEnable = true;
              //                       status.inet2rf++;
              //                       igateTLM.INET2RF++;
              // #ifdef DEBUG
              //                       // printTime();
              //                       log_d("INET->RF ");
              //                       log_d("%s\n", line.c_str());
              // #endif
              //                     }
              //                   }
              //                 }
              //                 else
              //                 {
              //                   igateTLM.DROP++;
              //                   log_d("INET Message TELEMETRY from ");
              //                   log_d("%s\n", src_call.c_str());
              //                   ;
              //                 }
              //               }

              log_d("INET: %s\n", line.c_str());
              char raw[500];
              memset(&raw[0], 0, sizeof(raw));
              start_val = line.indexOf(":", 10); // Search of info in ax25
              if (start_val > 5)
              {
                String info = line.substring(start_val + 1);
                // info.toCharArray(&raw[0], info.length(), 0);
                memcpy(raw, info.c_str(), info.length());

                uint16_t type = pkgType(&raw[0]);
                int start_dstssid = line.indexOf("-", 1); // get SSID -
                if (start_dstssid < 0)
                  start_dstssid = line.indexOf(" ", 1); // get ssid space
                char ssid = 0;
                if (start_dstssid > 0)
                  ssid = line.charAt(start_dstssid + 1);

                // if ((type != PKG_TELEMETRY) && (type != PKG_QUERY) && (type != PKG_STATUS) && (type != PKG_MESSAGE) && (ssid > 47 && ssid < 58))
                if (ssid > 47 && ssid < 58)
                {
                  size_t len = src_call.length();
                  char call[15];
                  memset(call, 0, sizeof(call));
                  if (len > 15)
                    len = 15;
                  memcpy(call, src_call.c_str(), len);
                  call[14] = 0;
                  memset(raw, 0, sizeof(raw));
                  memcpy(raw, line.c_str(), line.length());
                  raw[sizeof(raw) - 1] = 0;
                  int idx = pkgListUpdate(call, raw, type, 1);
                  int cnt = 0;
                  if (idx > -1)
                  {
                    // Put queue affter filter for display popup
                    if (config.rx_display && config.dispINET && (type & config.dispFilter))
                    {
                      cnt = pushTNC2Raw(idx);
                      log_d("INET_putQueueDisp:[pkgList_idx=%d/queue=%d,Type=%d] %s\n", idx, cnt, type, call);
                    }
                  }

                  // INET2RF affter filter
                  if (config.rf_en && config.inet2rf)
                  {
                    if (type & config.inet2rfFilter)
                    {
                      char strtmp[300];
                      String tnc2Raw = "";
                      if (config.aprs_ssid == 0)
                        sprintf(strtmp, "%s>APTWR", config.aprs_mycall);
                      else
                        sprintf(strtmp, "%s-%d>APTWR", config.aprs_mycall, config.aprs_ssid);
                      tnc2Raw = String(strtmp);
                      tnc2Raw += ",RFONLY"; // fix path to rf only not send loop to inet
                      tnc2Raw += ":}";      // 3rd-party frame
                      tnc2Raw += line;
                      pkgTxPush(tnc2Raw.c_str(), tnc2Raw.length(), 0);
                      status.inet2rf++;
                      igateTLM.INET2RF++;
                      log_d("INET2RF: %s\n", line);
                    }
                  }
                }
              }
            }
            // free(raw);
          }
        }
      }
    }

    if (millis() > pingTimeout)
    {
      pingTimeout = millis() + 300000;
      log_d("Ping GW to %s\n", WiFi.gatewayIP().toString().c_str());
      if (ping_start(WiFi.gatewayIP(), 3, 0, 0, 5) == true)
      {
        log_d("GW Success!!\n");
      }
      else
      {
        log_d("GW Fail!\n");
        WiFi.disconnect();
        wifiTTL = 0;
      }
      if (config.vpn)
      {
        IPAddress vpnIP;
        vpnIP.fromString(String(config.wg_gw_address));
        log_d("Ping VPN to %s", vpnIP.toString().c_str());
        if (ping_start(vpnIP, 2, 0, 0, 10) == true)
        {
          log_d("VPN Ping Success!!");
        }
        else
        {
          log_d("VPN Ping Fail!");
          wireguard_remove();
          delay(3000);
          wireguard_setup();
        }
      }
    }
  }
}
